{"data":[{"word":"et al","state":"abbr","def":"(အမည္ေနာက္၌သံုးေသာစကား)။ ႏွင့္ အျခား သူမ်ား၊ အရာမ်ား။"},{"word":"et cetera","state":"abbr","def":"စသည္။ စသည္ျဖင့္။"},{"word":"etch","state":"v","def":"အေရးအေၾကာင္းျခစ္၍ (သို႔) အေရးအေၾကာင္းတြင္ ငရဲမီးျဖင့္ စား၍ပံုေဖာ္သည္။ သတၱဳျပားေပၚတြင္ ငရဲမီးျဖင့္စား၍ ပံုေဖာ္သည္။"},{"word":"etching","state":"n","def":"ယင္းသို႔ ပံုေဖာ္ေသာ အတတ္ပညာ။ ထြင္းထားေသာ သတၱဳျပားျဖင့္ ရိုက္ႏိွပ္ထားသည့္စာ၊ ရုပ္ပံု။"},{"word":"eternal","state":"adj","def":"အဆံုးအစမရိွေသာ။ အဆံုးမရိွေသာ။ ထာဝရ။ အဆံုးမသတ္ႏိုင္ေသာ။ အေတာ မသတ္။"},{"word":"eternal triangle","state":"n","def":"သံုးပြင့္ဆိုင္အခ်စ္ (ဇာတ္လမ္း)။"},{"word":"eternal verity","state":"n","def":"အေျခခံကိုယ္က်င့္တရား။ အေျခခံလူ႔က်င့္ဝတ္။"},{"word":"eternally","state":"adv","def":"ထာဝရ။ ထာဝစဉ္။ အျမဲ။"},{"word":"eternity","state":"n","def":"အဆံုးမရိွေသာကာလ၊ အဓြန္႔။ ထာဝရ။ (ထာဝရျမဲတည္ေသာ) တမလြန္ဘဝ။ တမလြန္ သံသရာ။ (အခ်ိန္) ကေမၻကမာၻ။ တစ္ကမာၻ။"},{"word":"ether","state":"n","def":"အီသာ။ အရက္ျပန္မွထုတ္သည့္ အေရာင္မဲ့ ေဆးရည္။ (ေဖ်ာ္ေဆး၊ ေမ့ေဆး၊ ထံုေဆးအျဖစ္ သံုးသည္။) ေလထု။"},{"word":"ethereal","state":"adj","def":"အလြန္ သိမ္ေမြ႔ႏူးညံ့ေသာ။"},{"word":"ethic","state":"n","def":"လူ႔က်င့္ဝတ္။ ကိုယ္က်င့္သိကၡာ။ က်င့္ဝတ္တရား။ ကိုယ္က်င့္တရား။ ကိုယ္က်င့္တရားဆိုင္ရာ ပညာ။"},{"word":"ethical","state":"adj","def":"လူ႔က်င့္ဝတ္ႏွင့္ဆိုင္ေသာ။ လူ႔က်င့္ဝတ္ႏွင့္ ကိုက္ညေသာ။"},{"word":"ethics","state":"n","def":"ကိုယ္က်င့္တရား"},{"word":"ethnic","state":"adj","def":"လူမ်ိဳးစုတစ္စုႏွင့္ သက္ဆိုင္ေသာ။ ဇာတိ၊ မ်ိဳးႏြယ္အားျဖင့္ တိုင္းျပည္၊ ေဒသ တစ္ခုခုႏွင့္ သက္ဆိုင္ေသာ။ (အထူးသျဖင့္) ဥေရာပ၊ အေမရိကန္တို႔၏ ယဉ္ေက်းမႈမဟုတ္ေသာ။"},{"word":"ethnic cleansing","state":"n","def":"လူမ်ိဳးတံုး သတ္ျဖတ္ေရး ဝါဒ၊ သတ္ျဖတ္မႈ။"},{"word":"ethnocentric","state":"adj","def":"မိမိယဉ္ေက်းမႈကို ဗဟိုျပဳ၍ စံထားေသာ။"},{"word":"ethnographer","state":"n","def":"ယင္းပညာရွင္။"},{"word":"ethnography","state":"n","def":"လူမ်ိဳးႏွင့္ ယဉ္ေက်းမႈ သရုပ္ခဲြျခင္း ပညာရပ္။ လူမ်ိဳးခြေဗဒ။"},{"word":"ethos","state":"n","def":"အသိုင္းအဝိုင္း၊ အုပ္စုတစ္ခု၏ စိတ္ဓာတ္၊ ဓေလ့စရိုက္ စသည့္ သီးျခားလကၡဏာ။"},{"word":"etiolated","state":"adj","def":"အလင္းေရာင္မရ၍ ေဖ်ာ႔ေတာ႔ၾကံဳလီွ ေသာ။"},{"word":"etiquette","state":"n","def":"က်င့္ဝတ္ထံုးတမ္း။ေလာကဝတ္။ ယဉ္ေက်းရည္မြန္မႈ။"},{"word":"etymology","state":"n","def":"(ေဝါဟာရ) ရင္းျမစ္ေဗဒ။ ေဝါဟာရသမိုင္း။ နိရုတၱိ။"},
]}