{"data":[{"word":"kaffir","state":"n","def":"အာဖရီကတိုက္ လူမည္း (အားႏိွမ္႔ခ်ေခၚေဝၚေသားစကား"},{"word":"Kaiser","state":"n","def":"(၁၉၁၈-ခုႏွစ္မတိုင္မီ ဂ်ာမနီႏိုင္ငံဧ။္) ဧကရာဇ္ဘုရင္၊ ကိုင္ဇာဘုရင္။"},{"word":"kakemono","state":"n","def":"နံရံတြင္ ခ်ိတ္ဆဲြးရေသား ဂ်ပန္ ပန္းခ်ီကား (အလိပ္)"},{"word":"kale","state":"n","def":"ကိုက္လန္။"},{"word":"kale, kail","state":"n","def":"အရြက္လိပ္သည့္ေဂၚဖီထုပ္။ (ကိုက္လန္)"},{"word":"kaleidoscope","state":"n","def":"ရုပ္စံုမွန္ေျပာင္း။ ပန္းစံုဘူး။ အဆက္မျပတ္ လ်င္ျမန္စြာ ေျပာင္းလဲ ေနသည့္ ရႈကြက္၊ ျမင္ကြင္း။"},{"word":"kaleidoscopic","state":"adj","def":"ရုပ္စံု မွန္ေျပာင္း ၾကည့္ရသကဲ့သို႔ အဆက္မျပတ္ လ်င္ျမန္စြာ ေျပာင္းလေနေသာ (ျမင္ကြင္း၊ ျဖစ္စဉ္)။"},{"word":"kalends","state":"n","def":"ေရွးေခတ္ ေရားမ ျပကၡဒိန္အရ လဆန္းတစ္ရက္ေန့။"},{"word":"kamikaze","state":"adj","def":"အသက္ကို ပဓာနမထားဘဲ တေဇာက္ကန္း လုပ္ေဆာင္ေသာ။"},{"word":"kampong","state":"n","def":"ျခံခတ္ထားေသားဝင္း။ ေျမကြက္။ ေက်းရႊာ။"},{"word":"kanganroo","state":"n","def":"သားပိုက္ေကာင္။"},{"word":"kanganroo court","state":"n","def":"ျပည္သူ႔တစ္ရားခြင္၊ အလု္သမား အက်ဉ္းသားစသည္တို႔က ယင္းတို႔အက်ိဳး ဆန္က်င္သူအား စစ္ေဆးရန္ ဖဲြ႔စည္းထားေသား ခံုရံုး။"},{"word":"kangaroo","state":"adj","def":"သားပိုက္ေကာင္။ (အမသည္ ကေလးငယ္ကို ဝမ္းဗိုက္အိတ္ငယ္ျဖင့္ သယ္ယူသည္။)"},{"word":"kangaroo","state":"n","def":"သားပိုက္ေကာင္"},{"word":"kangaroo court","state":"n","def":"ဥပေဒေဘာင္မဝင္ေသာ တရားရံုး။ (အက်ဉ္းသမားမ်ား အခ်င္းခ်င္း၊ သပိတ္ေမွာက္ အလုပ္သမားမ်ား အခ်င္းခ်င္း ၄င္းတို႔အတြင္း ပဋိပကၡမ်ား ေျဖရွင္းရန္ ဖဲြ႔စည္းသည့္ တရားရံုး။)"},{"word":"kangaroos","state":"n[pl]","def":"သားပိုက္ေကာင္မ်ား"},{"word":"kaolin","state":"n","def":"ေၾကြထည္ျပဳလုပ္ရန္၊ ေဆးဝါးေဖာ္စပ္ရန္ အသံုးျပဳ သည့္ ျဖဴေဖြးႏူးညံ့ေသာ ေျမေစး။ ေျမေစးျဖဴ။ ေကအိုလင္။"},{"word":"kapok","state":"n","def":"မိႈ႔။ လဲ။"},{"word":"kaput","state":"adj","def":"ပ်က္စီး [ေသာ]။ ကိစၥေခ်ာ [ေသာ]။"},{"word":"karat","state":"n","def":"ေရႊရည္အတိုင္းအတာ ကရက္။"},{"word":"karate","state":"n","def":"ကရာေတး။ ဂ်ပန္လက္နက္မဲ့တိုက္ခိုက္နည္း။"},{"word":"karma","state":"n","def":"ကံ။ ေနာင္ဘဝတြင္ ကံၾကမၼာကို ဖန္တည္းသည့္ လူတစ္ဦးဧ။္ ဘဝအဆက္ဆက္ ျပဳခဲ့ေသား အျပဳအမူမ်ား"},{"word":"kava","state":"n","def":"ပိုလီရွန္း ကြ်န္းမ်ားရိွ ငရုတ္ေကာင္းပင္တစ္မ်ိဳး။ ယင္းအပင္ဧ။္ အျမစ္မွ ေဖာက္သည့္အရက္။"},{"word":"kayak","state":"n","def":"သစ္သားကိုယ္ထည္ ေဘာင္ေပၚတြင္ ဖ်ံေရျဖင့္ အုပလထားေသာ အက္စကီမိုး လူမ်ိဳးသံုးေလငယ္။"},
]}