{"data":[{"word":"SI","state":"abbr","def":"တိုင္းတာမႈယူနစ္ဆိုင္ရာႏိုင္ငံတကာစနစ္။"},{"word":"Siamese","state":"adj","def":"ထိုင္းႏိုင္ငံ၊လူမ်ိဳး၊ဘာသာစကားႏွင့္ဆိုင္ေသာ။ ကထိုင္းႏိုင္ငံဖြား။ ခယင္းဘာသာစကား။ ယိုးဒယားေၾကာင္။ အေမြးတို၍မ်က္လံုးျပာျပီးမ်က္ခြက္ႏွင့္နားရြက္ညိုမည္းေသာေၾကာင္မ်ိဳး။ ယိုးဒယားေၾကာင္။ ကိုယ္ခ်င္းဆက္အျမႊာ။"},{"word":"sibilant","state":"adj","def":"ရွည္လ်ားေသာသံျဖင့္သို႔ကဲ့သို႔ျမည္ေသာ။ သြားေနာက္နားႏွင့္လွ်ာဖ်ားၾကားမွေလတိုးထြက္သည့္ဗ်ည္းသံမ်ား။ သာဓက။ ။ စ္ဇ္ယွ္ဇ်္ခ်္ဂ်္။ ယင္းဗ်ည္းအကၡရာ။"},{"word":"sibling","state":"n","def":"တစ္အူထံု႔ဆင္းညီရင္းအစ္ကို၊ေမာင္ရင္းႏွမ၊ညီရင္းအစ္မ။"},{"word":"sic","state":"adv","def":"မူရင္းအတိုင္းအတိအက်။ တစ္ဆင့္ကိုးကားေဖာ္ျပသည့္စကားရပ္၌စကားအမွားအယြင္းေနာက္တြင္သူ႔မူရင္းအတိုင္းျဖစ္ေၾကာင္းဝိုက္ကြင္းျဖင့္ေဖာ္ျပခ်က္။"},{"word":"sick","state":"adj","def":"မက်န္းမာေသာ။ ေနမေကာင္းေသာ။ နာေသာ။ ပ်ိဳ႕အန္ခ်င္ေသာ။ ျငီးေငြ႔ေသာ။ စိတ္ကုန္ေသာ။ စက္ဆုပ္ေသာ။ စိတ္ဆင္းရေသာ။ စိတ္ပ်က္ေသာ။ စက္ဆုပ္ေသာ။ မသတီစရာ။ ေအာ္ဂလီဆန္ခ်င္ေသာ။ အန္ဖတ္။ နာမက်န္းသူ။ ဖ်ားသူ။ အန္သည္။ ေနမေကာင္းျဖစ္သည္။ ေဆးခြင့္တိုင္သည္။ ေအာ႔ႏွလံုးနာေစသည္။ မူးျခင္း။ ေတာက္ျခင္း။ စက္ဆုပ္သည္။ အထူးစိတ္ပ်က္သည္။ စိတ္မခ်မ္းေျမ့စြာႏွင့္။ ျပင္းထန္စြာေခါင္းကိုက္ျပီးအန္ျခင္း။ နာမက်န္းခြင့္။ ေဆးခြင့္ျဖင့္ေနခ်ိန္။ ေဆးခြင့္ျဖင့္ေနစဉ္ရသည့္လစာ။ ရံြသည္။ ေအာ္ဂလီဆန္သည္။ အန္ထုတ္သည္။"},{"word":"sickbay","state":"n","def":"သေဘၤာစသည္တြင္နာမက်န္းသူမ်ားအတြက္သီးသန္႔ခန္း။ ဖ်ားနာခန္း။"},{"word":"sickbed","state":"n","def":"ေနထိုင္မေကာင္းသူ၏အိပ္ရာ။"},{"word":"sicken","state":"v","def":"ေအာ္ဂလီဆန္ေစသည္။ ဖ်ားသည္။ နာသည္။ လြမ္းဖ်ားလြမ္းနာက်သည္။ ရံြရွာဖြယ္။ စက္ဆုပ္ဖြယ္။ စိတ္၊နား၊မ်က္စိစသည္မခ်မ္းသာစရာ။ မခ်င့္မရဲျဖစ္စရာ။"},{"word":"sicker","state":"adj[com]","def":"မက်န္းမာ"},{"word":"sickest","state":"adj[sup]","def":"မက်န္းမာ"},{"word":"sickle","state":"n","def":"တံစဉ္။ ေသြးအားနည္းသူမ်ားတြင္ေတြ႔ရတတ္သည့္တံစဉ္ပံုေသြးနီကလာပ္စည္းတစ္မ်ိဳး။"},{"word":"sickly","state":"adj","def":"ခ်ဴခ်ာေသာ။ မမာပံုေပါက္ေသာ။ ပိန္ပိန္လီွလီွ။ ေပ်ာ႔တေပ်ာ႔ဖပ္။ ခပ္ယဲ့ယဲ့။ မႏွစ္သက္ဖြယ္။ အန္ခ်င္စရာ။"},{"word":"sickness","state":"n","def":"နာဖ်ားမက်န္းျဖစ္ျခင္း။ ေရာဂါ။ အနာ။ အန္ခ်င္ျခင္း။ မက်န္းမာသျဖင့္အလုပ္မဆင္းႏိုင္သူမ်ားအတြက္အစိုးရကေထာက္ပံ့ေငြ။"},{"word":"sickroom","state":"n","def":"ေနမေကာင္းသူအတြက္ထားေသာအခန္း။ လူနာခန္း။"},{"word":"side","state":"n","def":"ဘက္ျခမ္း။ ဘက္။ တစ္ဖက္။ ဘက္။ ကနံ။ ေဘး။ နံေတာင္း။ ခေဘး။ အနား။ အပါး။ ကနံပါး။ ေဘး။ နံ။ ခေဘးဘက္မ်က္ႏွာျပင္။ အစြန္း။ အနား။ အပါး။ ေဘး။ နံ။ ေဘး။ စာရြက္၊အထည္၊ဓာတ္ျပားစသည္မ်က္ႏွာ၊ဘက္။ ဒုပံု၏မ်က္ႏွာျပင္ညီ။ ျပင္ညီပံု၏အနား။ ၁ဘက္။ ၁ကအျမင္။ ရပ္တည္ခ်က္။ သေဘာထား။ ဘက္။ ခရႈေထာင့္။ ဘက္။ ၁ဘက္။ အသင္း။ ၁ေဆြမ်ိဳးေတာ္စပ္သည့္ဘက္။ ၁အမေကာင္ျခမ္း။ ၁ရုပ္သံဆက္ေၾကာင္း။ ေရြးရန္ႏွစ္ခုအနက္မွတစ္ခုခုေရြးသည္။ စည္းရံုးႏိုင္သည္စိတ္ဆိုးေအာင္လုပ္မိသည္။ တစ္ပန္းသာသည္။ မွန္းခ်က္ႏွင့္ႏွမ္းထြက္မကိုက္ေအာင္အဖ်ားရႉးသြားသည္။ မယံုရ။ အဘက္ဘက္မွ။ ဘက္ေပါင္းစံုမွ။ နည္းနည္းသည္။ လြန္းသည္။ ေဘးသို႔၊မွာ။ ေရႊ႔ဆိုင္းလိုက္သည္။ အသက္ေလးဆယ္၊ငါးဆယ္စသည္ေအာက္ေက်ာ္ေက်ာ္။ ေဘးပန္းအေနႏွင့္။ တိတ္တိတ္ပုန္း။ ဘက္မွရပ္တည္သူ။ ဘက္ေတာ္သား။ အျခားတစ္ဖက္တြင္။ ဆန္႔က်င္ဘက္အားျဖင့္။ ေဘးခ်င္းယွဉ္လ်က္။ လက္တဲြလ်က္။ အတူတကြ။ လက္တဲြလ်က္။ လက္တဲြမျဖဳတ္ဘဲ။ လက္တဲြလ်က္။ ေဘးတဲြပါေမာ္ေတာ္ဆိုင္ကယ္။ ဘက္၊ေဘး၊နံရိွေသာ။ အရံဟင္း။ ေဆးဝါးစသည္၏ပဓာနသက္ေရာက္မႈႏွင့္အတူတကြျဖစ္တတ္ေသာမလိုလားအပ္သည့္ပူးတဲြသက္ေရာက္မႈ၊ေနာက္ဆက္တဲြသက္ေရာက္မႈ။ ေဘးပန္းဆိုးက်ိဳး။ အဓိကမဟုတ္ေသာေဘးပန္းကိစၥ။ ေဘးမွ။ သီးျခားမွာသည့္ဟင္းရံပဲြ။ လမ္းသြယ္။ တင္ပါးလဲႊထိုင္လ်က္ျမင္းစီးျခင္း။ အူတက္မတတ္ရယ္ရေသာ။ ျမိဳ႕တြင္းလမ္းမမွခဲြထြက္သည့္ေဘးလမ္း။ လမ္းေျမွာင္။ သြားရင္းလာရင္းခလုတ္တိုက္သြားျခင္း။ မဆိုင္သည့္အေပါက္ကလိုင္ႏွင့္ေခါက္ျခင္း။ ေဘးတိုက္ျမင္ကြင္း။ ပါးမုန္းေမြး။ ကိုဆန္႔က်င္ျပီးဘက္ကပါသည္။ ႏွစ္ေယာက္ခ်င္းသီးသန္႔စကားေျပာသည္။ ဘက္ကပါသည္။ ဘက္လိုက္သည္။"},{"word":"side dishes","state":"n","def":"တို႔စရာမ်ား"},{"word":"side walk","state":"n","def":"လူသြားစၾကၤန္"},{"word":"sideboard","state":"n","def":"ပန္းကန္၊ဖန္ခြက္စသည္ထည့္ရာဗီရို။ နားသယ္ေမြး။"},{"word":"sidekick","state":"n","def":"အေဖာ္။ လက္ေထာက္။ ေအာက္ဆဲြ။"},{"word":"sidelight","state":"n","def":"ယာဉ္ေရွ႕မီးအေသး။ တစ္ႏြယ္ငင္တစ္စင္ပါဆိုသလိုတေစ့တေစာင္းသိလာရသည့္အခ်က္။"},{"word":"sideline","state":"n","def":"ေဘးပန္း။ ေဘးေပါက္။ ေဘာလံုးကြင္း၊တင္းနစ္ကြင္းစသည္ေဘးစည္း၊ကြင္းေဘး။ အားကစားပဲြ၊အသင္းစသည္မွေဘးထြက္ေနရသည္။ ေဘးမွထိုင္လ်က္။"},{"word":"sides","state":"n[pl]","def":"ဘက္ျခမ္းမ်ား"},{"word":"sideways","state":"adj","def":"ေဘးတိုက္"},{"word":"sideways","state":"adv","def":"ေဘးတိုက္"},{"word":"siege","state":"n","def":"လက္နက္လူသူျဖင့္ ဝိုင္းရံထားျခင္း"},{"word":"sieges","state":"n[pl]","def":"လက္နက္လူသူျဖင့္ ဝိုင္းရံထားျခင္းမ်ား"},{"word":"sight","state":"n","def":"အျမင္အာရံု"},{"word":"sights","state":"n[pl]","def":"အျမင္အာရံုမ်ား"},{"word":"sign","state":"n","def":"သေကၤတ"},{"word":"sign","state":"v","def":"လက္မွတ္ထိုး"},{"word":"signal","state":"n","def":"အခ်က္ျပျခင္း"},{"word":"signal","state":"v","def":"အခ်က္ျပ"},{"word":"signaled","state":"v[pt]","def":"အခ်က္ျပခဲ့"},{"word":"signaled","state":"v[pp]","def":"အခ်က္ျပခဲ့ျပီး"},{"word":"signals","state":"n[pl]","def":"အခ်က္ျပျခင္းမ်ား"},{"word":"signals","state":"v[sg]","def":"အခ်က္ျပ"},{"word":"signature","state":"n","def":"ထိုးျမဲလက္မွတ္"},{"word":"signatures","state":"n[pl]","def":"ထိုးျမဲလက္မွတ္မ်ား"},{"word":"signed","state":"v[pt]","def":"လက္မွတ္ထိုးခဲ့"},{"word":"signed","state":"v[pp]","def":"လက္မွတ္ထိုးခဲ့ျပီး"},{"word":"significance","state":"n","def":"ရည္ရြယ္ခ်က္"},{"word":"significant","state":"adj","def":"အေရးပါ"},{"word":"significantly","state":"adv","def":"သိသာထင္ရွားစြာ"},{"word":"signing","state":"v[ing]","def":"လက္မွတ္ထိုးေန"},{"word":"signs","state":"n[pl]","def":"သေကၤတမ်ား"},{"word":"signs","state":"v[sg]","def":"လက္မွတ္ထိုး"},{"word":"silence","state":"n","def":"တိတ္ဆိတ္ျခင္း"},{"word":"silences","state":"n[pl]","def":"တိတ္ဆိတ္ျခင္းမ်ား"},{"word":"silent","state":"adj","def":"အသံမထြက္"},{"word":"silenter","state":"adj[com]","def":"အသံမထြက္"},{"word":"silentest","state":"adj[sup]","def":"အသံမထြက္"},{"word":"silk","state":"n","def":"ပိုးျခည္"},{"word":"silk cotton tree","state":"n","def":"လဲပင္"},{"word":"silk worm","state":"n","def":"ပိုးဇာေကာင္"},{"word":"silks","state":"n[pl]","def":"ပိုးခ်ည္မ်ား"},{"word":"sillier","state":"adj[com]","def":"ဦးေႏွာက္မရိွ"},{"word":"silliest","state":"adj[sup]","def":"ဦးေႏွာက္မရိွ"},{"word":"silly","state":"adj","def":"ဦးေႏွာက္မရိွ"},{"word":"silo","state":"n","def":"သိုေလွာင္ရံု"},{"word":"silos","state":"n[pl]","def":"သိုေလွာင္ရံုမ်ား"},{"word":"silt","state":"n","def":"ႏုန္းေျမ"},{"word":"silts","state":"n[pl]","def":"ႏုန္းေျမမ်ား"},{"word":"silver","state":"n","def":"ေငြ"},{"word":"silver","state":"adj","def":"ေငြျဖင့္ျပဳလုပ္ထား"},{"word":"silver catfish","state":"n","def":"ငါးႏုသန္း"},{"word":"Silver Wedding Anniversary","state":"n","def":"ေငြရတုသဘင္"},{"word":"silvered bardb","state":"n","def":"ငါးဘဲျဖဴ"},{"word":"silvers","state":"n[pl]","def":"ေငြမ်ား"},{"word":"similar","state":"adj","def":"ဆင္"},{"word":"similarly","state":"adv","def":"တူညီခ်က္"},{"word":"simple","state":"adj","def":"ရိုး"},{"word":"simple hurt","state":"n","def":"အနည္းငယ္နာက်င္မု"},{"word":"simpler","state":"adj[com]","def":"ပို၍လြယ္"},{"word":"simplest","state":"adj[sup]","def":"အလြယ္ဆံုး"},{"word":"simply","state":"adv","def":"အလြယ္တကူ"},{"word":"since","state":"prep","def":"တတည္းက"},{"word":"since","state":"adv","def":"သည့္ေနာက္မွာ"},{"word":"sincere","state":"adj","def":"ဟန္မေဆာင္"},{"word":"sincerely","state":"adv","def":"ရိုးသားမု"},{"word":"sincerer","state":"adj[com]","def":"ဟန္မေဆာင္"},{"word":"sincerest","state":"adj[sup]","def":"ဟန္မေဆာင္"},{"word":"sine","state":"n","def":"ေထာင့္မွန္ၾတိဂံတြင္ေထာင့္မွန္မဟုတ္ေသာေထာင့္တစ္ခု၏မ်က္ႏွာခ်င္းဆိုင္အနားႏွင့္ေထာင့္မွန္ခံအနားတို႔၏အခ်ိဳး။ ဆိုင္း။"},{"word":"sine die","state":"adv","def":"ရက္အကန္႔အသတ္မရိွ။"},{"word":"sinecure","state":"n","def":"အလုပ္လုပ္ရန္မလိုအပ္လွဘဲဂုဏ္သိကၡာ၊ေငြေၾကးရရိွသည့္ရာထူး။"},{"word":"sinew","state":"n","def":"ၾကြက္သားႏွင့္အရိုးကိုျမေအာင္တြယ္ထားသည့္အရြတ္မွ်င္။ အရြတ္။ ကကာယအား။ ၾကြက္သား။ ခအားခြန္ဗလ။ သန္မာၾကံ့ခိုင္ေသာ။ ခက္မာေသာ။ ခြန္အားရိွေသာ။ သူ၏ခြန္အားရိွေသာစကားေျပဟန္။"},{"word":"sing","state":"v","def":"သီခ်င္းဆိုသည္။ သီဆိုသည္။ ေတးဆိုသည္။ ေတးသီသည္။ မင္းဆိုေနတာအသံမကိုက္ဘူး။ သူစႏၵရားႏွင့္တဲြဖက္သီဆိုသည္။ သူကေလးကိုေတးဆိုသိပ္သည္။ တရီႊရီႊ၊တေဝါေဝါျမည္သည္။ ႏွင့္လိုက္ဆိုသည္။ ၂ေလသံတစ္မ်ိဳးေျပာင္းသည္။ သီဆိုသူ။ အဆိုေတာ္။ အဆိုပညာ။ သူသီခ်င္းဆိုတဲ့အသံကသိပ္ေကာင္းတာပဲ။ သီဆိုမႈ။ သီဆိုသံ။ ေတးသံ။ ဖဲြ႔ဆိုသီက်ဴးသည္။ ပို၍က်ယ္က်ယ္ျမွင့္ဆိုသည္။ တို႔ၾကားရေအာင္က်ယ္က်ယ္ဆို။"},{"word":"singe","state":"v","def":"ကမီးဟပ္မိျပီးကြ်မ္းသြားသည္။ ခမီးျမိႈက္သည္။ မီးျမိႈက္ျခင္း။ မီးဟပ္မိျခင္း။"},{"word":"singer","state":"n","def":"အဆိုေတာ္"},{"word":"singers","state":"n[pl]","def":"အဆိုေတာ္မ်ား"},{"word":"singing","state":"n","def":"အဆိုပညာ"},{"word":"singing","state":"v[ing]","def":"သီဆိုေန"},{"word":"single","state":"adj","def":"ကတစ္တည္းေသာ။ တစ္ပြင့္တည္းေသာႏွင္းဆီနီ။ က်ားမသီးသန္႔ပညာေရး။ ခတစ္မူထူးေသာ။ သီးျခားျဖစ္ေသာ။ ေသတၱာထဲရိွသမွ်တစ္ခုမက်န္အကုန္ထုတ္ပစ္လိုက္သည္။ တစ္ကိုယ္ေရတစ္ကာယ။ အိမ္ေထာင္မရိွေသာ။ တစ္ေယာက္စာ၊သံုး၊အတြက္စသည္။ အသြားတစ္ေခါက္တည္းအတြက္။ ၂အသြားလက္မွတ္။ တစ္ဖက္စီတြင္သံုးမိနစ္စာခန္႔အသံသြင္းခ်က္တိုတိုပါရိွသည့္လံုးခ်င္းဓာတ္ျပား။ ေဘာက္ျပား။ ၂တစ္ကိုယ္ေရတစ္ကာယသမားမ်ား။ တစ္ဖက္လွ်င္တစ္ဦးခ်င္းယွဉ္ျပိဳင္သည့္အားကစားပဲြ။ တစ္ဦးခ်င္းျပိဳင္ပဲြ။ ခရစ္ကက္ရိုက္ပဲြတစ္မွတ္ရသည့္ရိုက္ခ်က္။ ရင္ကဲြအက်ၤီ။ တစ္ဦးခ်င္းရင္ဆိုင္တိုက္ပဲြ။ ကိုယ္စီတိုက္ပဲြ။ အဆီဓာတ္နည္းသည့္မလိုင္။ တစ္ဆယ္ေအာက္ကိန္းမ်ား။ ေငြေဖာင္းပြမႈရာနႈန္းသည္၁၀ေအာက္သို႔ဆင္းသြားသည္။ တစ္ကိုယ္ေတာ္။ မိမိတစ္လက္တည္းေဆာင္ရြက္ေသာ။ တစ္ဦးတည္း။ ႏိုင္ငံအမ်ားစုေပါင္းပါဝင္ဖဲြ႔စည္းထားသည့္တစ္ခုတည္းေသာေဈးကြက္။ ဘံုေဈးကြက္။ စိတ္ျမဲျမံေသာ။ စဲြစဲြျမဲျမဲ။ စိုက္လိုက္မတ္တတ္ၾကိဳးပမ္းအားထုတ္မႈ။ အနက္မွအတြက္တစ္တည္းကြက္၍ေရြးသည္။ ကေလးမ်ားကိုတစ္ေယာက္တည္းအုပ္ထိန္းရသည့္မိခင္သို႔ဖခင္။ တစ္ေယာက္ခ်င္း။ သူ႔ဘာသာသူတစ္ေယာက္တည္း။"},{"word":"single room","state":"n","def":"တစ္ယာက္ခန္း"},{"word":"single-barrel","state":"n","def":"တစ္လံုးထိုးေသနတ္"},{"word":"singlet","state":"n","def":"ကရွပ္ေအာက္ခံစြပ္က်ယ္လက္ျပတ္။ ခအားကစားစြပ္က်ယ္။"},{"word":"sings","state":"v[sg]","def":"သီဆို"},{"word":"singsong","state":"adj","def":"နိမ္႔ခ်ည္ျမင့္ခ်ည္အသံ။ ယင္းသို႔ေသာေျပာဟန္။ တေပ်ာ္တပါးဝိုင္းဖဲြ႔၍သီဆိုျခင္း"},{"word":"singular","state":"n","def":"ဤအဘိဓာန္၌ဟုအတိုေကာက္သံုးသည္။ ဧကဝုစ္။ ဧကဝုစ္။ ကျပိဳင္စံကင္းေသာ။ အထူးေျပာပေလာက္ေသာ။ ခတစ္မူထူးျခားေသာ။ ဆန္းေသာ။ ထူးျခားေသာလကၡဏာ။ သူမ်ားႏွင့္မတူသည့္အရည္အခ်င္း။ ထူးထူးကဲကဲ။ ေျပာပေလာက္ေအာင္။ တစ္မူထူးစြာ။ ခြက်က်။"},{"word":"singular","state":"adj","def":"ဧကဝုစ္"},{"word":"sinister","state":"adj","def":"အတိတ္နိမိတ္မေကာင္းေသာ။ အႏၱရာယ္ျပဳမည့္လကၡဏာရိွေသာ။ သူ႔ၾကည့္ရတာရက္စက္ယုတ္မာပံုေပါက္လို႔စိတ္ေလးမိတယ္။"},{"word":"sink","state":"v","def":"ျမဳပ္သည္။ နစ္သည္။ ျမႈပ္သည္။ ႏွစ္သည္။ ဒုကၡေရာက္ေစသည္။ ဒုကၡေရာက္သည္။ နိမ္႔ဆင္းသည္။ ကြ်ံဝင္သည္။ ပံုလ်က္သားက်သည္။ က်ဆင္းသည္။ ဆုတ္ယုတ္သည္။ ေလ်ာ႔ပါးသည္။ သူေသလုေျမာပါးျဖစ္ေနျပီ။ မိတ္ေဆြေတြဆီကခိုးတယ္ဆို၊ဒေလာက္ေတာင္ယုတ္ကန္းရသလား။ တိမ္ဝင္သြားသည္။ ကတိုင္စိုက္သည္။ ခတြင္းစသည္တူးသည္။ ေဂါက္သီး၊ဘိလိယက္၊ေဘာလံုးစသည္က်င္းစိန္သည္။ အနီလံုးကိုထိပ္ကတြင္းထဲဝင္ေအာင္ထိုးသည္။ ယမကာေမာ႔သည္။ မ်ိဳသည္။ ႏွစ္ေယာက္တည္းဂ်င္တစ္ပုလင္းလံုးကုန္ေအာင္ေမာ႔ပစ္လိုက္ၾကသည္။ ကမီးဖိုပန္းကန္ေဆးကန္။ ခလက္ေဆးကန္။ မ်က္ႏွာသစ္ကန္။ ငူေနသည္။ ေငါင္ေနသည္။ အေတြးနက္ေနသည္။ ျပန္လည္သင့္ျမတ္သည္။ ရင္ၾကားေစ့သည္။ အေျခအေနသိပ္မဟန္ဟူေသာအသိ၊ခံစားမႈ။ ကိုယ္႔သူ႔ထိုက္ႏွင့္ကိုယ္႔သူ႔ကံေလ်ာက္လ်ားပဲ။ စိမ္႔ဝင္သည္။ နားဝင္သည္။ သေဘာေပါက္သည္။ အေျခအေနသို႔သက္ဆင္းက်ေရာက္သည္။ ျမဳပ္သြားေအာင္လီွး၊ကိုက္၊ထိုးသြင္းသည္။ ရင္းႏီွးျမႈပ္ႏံွသည္။"},{"word":"sinker","state":"n","def":"ငါးမွ်ားၾကိဳးခဲသီး။ ငါးဖမ္းပိုက္ခဲသီး။"},{"word":"sinking","state":"v[ing]","def":"နစ္ျမဳပ္ေန"},{"word":"sinks","state":"v[sg]","def":"နစ္ျမဳပ္"},{"word":"sinner","state":"n","def":"ဒုစရိုက္မႈ၊မေကာင္းမႈကိုျပဳေလ့ရိွသူ။ ငမိုက္သား။"},{"word":"Sino-","state":"coidmb","def":"တရုတ္။"},{"word":"sinuous","state":"adj","def":"အတြန္႔အလိမ္၊အေကြ႔အေကာက္၊အေကြ႔အဝိုက္မ်ားေသာ။"},{"word":"sinus","state":"n","def":"လူ႔ဦးေခါင္းခံြတြင္ႏွာေခါင္းေပါက္ႏွင့္ဆက္သြယ္ထားေသာဦးေခါင္းခံြအတြင္းေလလမ္းေၾကာင္း။ ႏွာပိတ္ျခင္း။"},{"word":"sip","state":"v","def":"နည္းနည္းခ်င္းစီစုပ္ေသာက္သည္။ တစ္ငံုစာ။"},{"word":"siphon","state":"n","def":"ျမင့္ရာ၌တည္ေသာအရည္ကိုနိမ္႔ရာသို႔စုပ္ထုတ္ယူရာ၌သံုးသည့္ပိုက္၊ျပြန္ေကာက္။ ျပြန္ေကာက္ျဖင့္စုပ္ထုတ္သည္။"},{"word":"sir","state":"n","def":"ကအမ်ိဳးသားတစ္ဦးအားယဉ္ေက်းစြာရည္ညႊန္းသည့္အာလုပ္။ ချဗိတိန္တြင္ဆရာကိုေက်ာင္းသူေက်ာင္းသားမ်ားကရည္ညႊန္းသည့္အာလုပ္။ ၂ခသမားရိုးက်ဆန္ဆန္စာေရးရာ၌ကုမၸဏီ၊ဌာနစသည္တာဝန္ခံကိုရည္ညႊန္းရာတြင္သံုးသည့္ပဋိသႏၶာရစကား။ လူၾကီးမင္းမ်ားခင္ဗ်ား။ ဘုရင္၊ဘုရင္မကခ်ီးျမွင့္သူေကာင္းျပဳသည့္`ဆာ´ဘဲြ႔။ လံုးဝမျဖစ္ပါ၊မသင့္ပါ။ မူးျပီးေမာင္းတယ္လို႔လံုးဝမဟုတ္ပါဆရာ။"},{"word":"sire","state":"n","def":"ဝက္၊ျမင္းစသည့္တိရစာၦန္၏အဖ။ ဘုရင္အားတင္ေလွ်ာက္ရာ၌သံုးသည့္အာလုပ္။ ဘုရား။ သားတင္သည္။"},{"word":"siren","state":"n","def":"အခ်က္ေပးဥဩ။ ကဂရိပံုျပင္လာမိန္းမကိုယ္လံုး၊ငွက္ဦးေခါင္းရိွေရသတၱဝါ။ ယင္းတြန္က်ဴးသံျဖင့္သေဘၤာမ်ားကိုေက်ာက္ေဆာင္မ်ားရိွရာသို႔မွ်ားေခၚေလ့ရိွသည္။ ခမာယာရွင္။"},{"word":"sirloin","state":"n","def":"အမဲခါးဆစ္သား။"},{"word":"sirocco","state":"n","def":"အာဖရိကမွဥေရာပေတာင္ပိုင္းသို႔တိုက္ခတ္ေသာေလပူ။ ဆေရာ႔ကို။"},{"word":"sisal","state":"n","def":"နာနတ္ေလွ်ာ္။"},{"word":"sissy","state":"n","def":"မိန္းမလ်ာ။ အေျခာက္။"},{"word":"sister","state":"n","def":"ႏွမ။ ညီမ။ အစ္မ။ အဖဲြ႔ဝင္အမ်ိဳးသမီးမ်ားအားေခၚေဝၚေသာအသံုးအနႈန္း။ ညီအစ္မ။ အမ်ိဳးသမီးကိုေခၚရာတြင္သံုးသည့္အာလုပ္။ အစ္မ။ ဟိုအစ္မအိတ္က်ခဲ့ျပီ။ ေဆးရံုလူနာေဆာင္တစ္ခု၏တာဝန္ခံသူနာျပဳဆရာမၾကီး။ ခရစ္ယာန္ဘာသာသီလရွင္။ အလားတူသေဘၤာ၊အဖဲြ႔အစည္းစသည္။ အသင္းအဖဲြ႔စသည္၌အမ်ိဳးသမီးအခ်င္းခ်င္းညီအစ္မရင္းခ်ာစိတ္ဓာတ္။ ရည္မွန္းခ်က္တူ၊ဘဝတူအမ်ိဳးသမီးတို႔၏အသင္းအဖဲြ႔။ ေယာက္မ။ ခယ္မ။ မရီး။ ညီအစ္မကဲ့သို႔ေသာ။ ႏွမလို။ အစ္မလို။"},{"word":"sister-in-law","state":"n","def":"ေယာက္မ"},{"word":"sisters","state":"n[pl]","def":"ညီအစ္မမ်ား"},{"word":"sit","state":"v","def":"ကထိုင္သည္။ ခထိုင္သည္။ ထိုင္ေစသည္။ ပန္းခ်ီအဆဲြခံသည္။ ဓာတ္ပံုအရိုက္ခံသည္။ ထိုင္သည္။ ကငွက္နားသည္။ ခဥက်င္း၌ငွက္ဝပ္သည္။ စည္းေဝးထိုင္သည္။ ရံုးထိုင္သည္။ စာေမးပြေျဖသည္။ တတ္တိုင္းရိွ၊လြတ္ေနသည္။ အေနေတာ္ပြ၊က်ပ္သည္။ မျဖံဳေပါင္။ ငုတ္တုတ္ထိုင္ေနသည္။ ဘုတ္ထိုင္ထိုင္သည္။ တပည့္ရင္းျဖစ္သည္။ အေႏၱဝါသိကတပည့္ျဖစ္သည္။ ကုလားထိုင္တြင္ေနာက္ေက်ာမီွ၍ေအးေအးလူလူထိုင္သည္။ အခံ့သားထိုင္ေနသည္။ လက္ပိုက္ၾကည့္ေနသည္။ ထိုင္ၾကည့္ေနသည္။ ထိုင္သပိတ္ေမွာက္ျခင္း။ ထိုင္နားျခင္း။ éထိုင္ရာမထစားရသည့္ထမင္းပဲြ။ ၂နယ္္ပါလီမန္အမတ္ျဖစ္သည္။ အခန္း၊အေဆာက္အအံုစသည္ကိုဆႏၵျပသည့္အေနျဖင့္ဝင္ေရာက္သိမ္းပိုက္သည္။ အေဆာက္အအံု၊ေနရာတစ္ခုခုမွ်ဖယ္မေပးဘဲဆႏၵျပနည္း။ သူတစ္ပါးေနရာတြင္ကိုယ္စားဝင္ေရာက္လုပ္ေပးသည္။ မဆီမဆိုင္ေဝဖန္တိကျပဳသည္။ အစည္းအေဝးစသည္၌ဝင္ေရာက္ေလ့လာသည္။ ကုပ္ႏိွပ္ေပးသည္။ ခြ်န္းအုပ္ေပးသည္။ အဖဲြ႔ဝင္ဦးပါဝင္သည္။ ေခ်ာင္ထိုးထားသည္။ ေခါက္ထားသည္။ ေလွနံႏွစ္ဖက္နင္းသည္။ အျပင္ထြက္ထိုင္သည္။ ေအာင့္အည္းလ်က္ျပီးဆံုးေအာင္ေနသည္။ ေဘးထိုင္ေနသည္။ ဒီတစ္ခ်ေတာ႔မကဘဲထြက္ထိုင္ေနလိုက္ဦးမယ္။ ပံုတူအဆဲြခံသူ။ လည္စင္းေပးေနသည့္အေကာင္။ ဆံုးခန္းတိုင္ေအာင္ေအာင့္အည္းေနသည္။ ဝဋ္ေၾကြးဆပ္သည္။ သည္အတိုင္းဆက္ေနသည္။ ေခါင္းမာမာေပကတ္ေနသည္။ တရားရံုးေတာ္၊ပါလီမန္လႊတ္ေတာ္စသည္လုပ္ငန္းေဆာင္ရြက္ခ်ိန္။ ထမင္းပဲြတစ္သုတ္စာၾကာျမင့္ခ်ိန္။ ထမင္းစားခန္းကက်ဉ္းေတာ႔တစ္ဝိုင္းစီႏွစ္သုတ္ခြေကြ်းရမယ္။ ေန့လယ္စာတစ္သုတ္မွာလူ၁၀ဝေလာက္ေကြ်းႏိုင္တယ္။ တစ္ထိုင္။ ဓာတ္ပံု၊ပန္းခ်ီအဆဲြခံရန္ထိုင္၊ေနေပးျခင္း။ အကာအကြယ္မဲ့ပစ္ကြင္း၊ပစ္မွတ္။ တရားဝင္ပိုင္ခြင့္တစ္စံုတစ္ရာရိွထားသည့္အိမ္ငွား၊အခန္းငွား။ ေခါင္းေထာင္ထသည္။ မအိပ္ဘဲထိုင္ၾကည့္သည္၊ထိုင္ေစာင့္သည္။ မတ္မတ္၊ထူထူေထာင္ေထာင္ထိုင္သည္။ အိပ္၊ထ၊မ၊တင္ေလ့က်င့္ခန္း။"},{"word":"sitar","state":"n","def":"ဂီတာႏွင့္ဆင္သည့္အိႏၵိယၾကိဳးတပ္တူရိယာ။"},{"word":"site","state":"n","def":"တည္ေနရာ။ ျဖစ္ပြားရာ။ တည္ရိွရာ။ ျပဳလုပ္ရာ။ တည္သည္။ ဆင္သည္။"},{"word":"sites","state":"n[pl]","def":"တည္ေနရာမ်ား"},{"word":"sits","state":"v[sg]","def":"ထိုင္"},{"word":"sitting","state":"v[ing]","def":"ထိုင္ေန"},{"word":"situate","state":"v","def":"တည္သည္။ ရိွသည္။ ထားသည္။ ဌာနခ်ဳပ္အသစ္ကိုဘယ္မွာထားမလဲ။ ျဖစ္ရပ္ႏွင့္စပ္လ်ဉ္းသည့္ေနာက္ခံအေျခအေနအဝဝကိုသရုပ္ေပၚေအာင္ေဖာ္ျပသည္။ အေျခအေနရိွေသာ။ ကေလးကေျခာက္ေယာက္၊ဝင္ေငြကလည္းမရိွနဲ့၊ငါ႔အေျခအေနတကယ္ဆိုးတာပဲ။"},{"word":"situation","state":"n","def":"အေျခအေန။ အေနအထား။ ပတ္ဝန္းက်င္အေနအထား။ အလုပ္အကိုင္။ မူေသဇာတ္ေဆာင္မ်ားပါဝင္သည့္ေရဒီယို၊ရုပ္သံဟာသဇာတ္လမ္းတဲြ။"},{"word":"situations","state":"n[pl]","def":"အေျခအေနမ်ား"},{"word":"six","state":"n","def":"ေျခာက္။ ဆဋႆဌ။ ဖရိုဖရဲ။ အိုးနင္းခြက္နင္း။ သိန္းဂဏန္း။ ေျခာက္ဘူး၊ေျခာက္ပုလင္းဝင္ဖာ။ ေျခာက္လံုးျပဴးေသနတ္။ ေျခာက္ေျမာက္။ ဆဋႆဌမ။ ေျခာက္ပံုတစ္ပံု။ ဂ်ီစီအီး̏ေအ˝အဆင့္စာေမးပဲြအတြက္ျပင္ဆင္ေနေသာအသက္၁၆ႏွစ္မွ၁၈ႏွစ္အတြင္းရိွေက်ာင္းသူ၊ေက်ာင္းသားမ်ားစာသင္ရာအတန္း။ အထက္ပါအတန္းမွေက်ာင္းသူ၊ေက်ာင္းသား။ အၾကားအျမင္။ မေနာဓာတ္။ ဂမၻီရဓာတ္။"},{"word":"Six Buddhist Synod","state":"n","def":"ဆဋႆဌမသံဂါယနာ"},{"word":"sixes","state":"n[pl]","def":"ေျခာက္"},{"word":"sixpence","state":"n","def":"ကေငြအေၾကြ၆ပဲနေစ့။ ၁၉၇၁ခုမတိုင္မီကျဗိတိန္တြင္သံုးခဲ့သည္။ ခ၆ပဲနေငြပမာဏ။"},{"word":"sixteen","state":"n","def":"၁တစ္ဆယ္႔ေျခာက္။ ဆယ္႔ေျခာက္။ ေသာဠသ။ တစ္ဆယ္႔ေျခာက္ေျမာက္။ ေသာဠသမ။"},{"word":"sixteens","state":"n[pl]","def":"တစ္ဆယ္႔ေျခာက္"},{"word":"sixteenth","state":"n","def":"၁၆ ၾကိမ္ေျမာက္"},{"word":"sixteenths","state":"n[pl]","def":"၁၆ ၾကိမ္ေျမာက္"},{"word":"sixth","state":"n","def":"ဆဋႆဌမ"},{"word":"sixths","state":"n[pl]","def":"ဆဋႆဌမ"},{"word":"sixties","state":"n[pl]","def":"ဆဋႆဌမ"},{"word":"sixtieth","state":"n","def":"အၾကိမ္ ၆၀ ေျမာက္"},{"word":"sixtieths","state":"n[pl]","def":"အၾကိမ္ ၆၀ ေျမာက္"},{"word":"sixty","state":"n","def":"၆ေျခာက္ဆယ္။ ၆၀မွ၆၉အတြင္းရိွကိန္း၊ႏွစ္၊အပူခ်ိန္အမွတ္စသည္။ အသက္၆၀ေက်ာ္၇၀ေအာက္။ ပဗာၻရဒသကထဲမွာ။ ၆၀ေျမာက္သို႔ေျခာက္ဆယ္ပံုတစ္ပံု။ ေျခာက္ဆယ္ပိုင္းတစ္ပိုင္း။"},{"word":"size","state":"n","def":"အရြယ္။ ပမာဏ။ ၾကီးမားေသာပမာဏ။ စံအတိုင္းအတာ။ သတ္မွတ္အရြယ္အစား။ ဆိုက္အၾကီး၊အေသး၊နံပါတ္စသည္။ ပမာဏကိုတိုင္းဆသည္။ အေျခာက္တိုက္အထင္တစ္ခဲြသားၾကီးေနသူကိုအျမင္မွန္ရေစသည္။ အေတာ္အတန္ၾကီးမားေသာ။ အရြယ္ရိွေသာ။ အကဲျဖတ္သည္။ သံုးသပ္သည္။ ခ်ည္၊စကၠူစသည္အေရာင္တင္ေကာ္ရည္။ ေကာ္တင္သည္။"},{"word":"sizzle","state":"v","def":"ဆီပူ၌တစ္စံုတစ္ရာေၾကာ္သကဲ့သို႔ရဲွရဲွျမည္သည္။ ယင္းသို႔ျမည္သံ။ အလြန္ရိုးတိုးရြတျဖစ္စရာေကာင္းေသာ။"},{"word":"sizzling rice soup","state":"n","def":"ဆန္ေလွာ္ဟင္းခ်ိဳ"},
]}