{"data":[{"word":"skate","state":"n","def":"ေရခဲျပင္စီးစကိတ္။ စကိတ္စီးသည္။ စကိတ္စီးကသည္။ အႏၱရာယ္ရိွႏိုင္သည္။ ျမန္ျမန္သုတ္သုတ္လုပ္သည္။ သုတ္ေျခတင္သည္။ လွည့္ပတ္ေက်ာ္လႊား၊ေရွာင္တိမ္းသည္။ စကိတ္စီးသူ။ တက္သုတ္ရိုက္လုပ္ေဆာင္သည္။ ေကာက္ကာငင္ကာလုပ္လိုက္ေတာ႔ေန့လယ္စာထမင္းစားခ်ိန္မွာျပီးေနျပီ။ စကိတ္စီးအားကစား။ ေျမျပင္စကိတ္ကြင္း။ ငါးလိပ္စြန္ကဲ့သို႔ပင္လယ္ေနအရိုးႏုငါးမ်ိဳး"},{"word":"skateboard","state":"n","def":"စကိတ္စီးရန္ဘီးပါသည့္ဖဝါးသာသာအျပား။ စကိတ္ေလွ်ာျပား။"},{"word":"skedaddle","state":"v","def":"တစ္ၾကိဳးတည္းႏွင့္လစ္သည္။"},{"word":"skein","state":"n","def":"ပိုး၊ခ်ည္စသည္အခင္။"},{"word":"skeletal","state":"adj","def":"အရိုးစုႏွင့္ဆိုင္ေသာ။ ကမၼဋႆဌာန္းရုပ္ေပါက္ေနေသာ။ အရိုးေပၚအေရတင္ျဖစ္ေနေသာ။ ပံုၾကမ္းေလာင္းအဆင့္။"},{"word":"skeleton","state":"n","def":"အရိုးစု။ အရိုးပေဒသာ။ ကအေဆာက္အအံုေအာက္ခံေဘာင္။ ခအေျခခံေကာက္ေၾကာင္း။ ပံုၾကမ္း။ မာတိကာမူၾကမ္း။ ဝန္ေဆာင္ႏိုင္ကာမတၱဦးေရ။ တစ္စံုတစ္ေယာက္ကိုထိခိုက္ႏိုင္သည့္အိမ္တြင္းကိစၥအရႈပ္ေတာ္ပံု။ ေသာ႔ခေလာက္၄၅မ်ိဳးဖြင့္ႏိုင္သည့္ေသာ႔။ ဘံုေသာ႔။ ေသာ႔မင္း။"},{"word":"sketch","state":"n","def":"ပံုၾကမ္း။ ပံုၾကမ္း။ ဟာသျပဇာတ္တို။ ဟာသစာတို။ ပံုၾကမ္းေရးသည္။ ပံုၾကမ္းေလာင္းသည္။ ပံုဆဲြစာအုပ္။ ျဖည့္စြက္သည္။ ေျမပံုၾကမ္း။ အၾကမ္းဖ်င္းေဖာ္ျပသည္။ အေပၚယံ။ မည္ကာမတၱ။ ဒီျဖစ္ရပ္ကိုျပန္စဉ္းစားလိုက္ေတာ႔ေရးေရးေလာက္ပဲမွတ္မေတာ႔တယ္။"},{"word":"sketch","state":"v","def":"ပံုၾကမ္းေရးျခစ္"},{"word":"sketched","state":"v[pt]","def":"ပံုၾကမ္းေရးျခစ္ခဲ့"},{"word":"sketched","state":"v[pp]","def":"ပံုၾကမ္းေရးျခစ္ခဲ့ျပီး"},{"word":"sketches","state":"v[sg]","def":"ပံုၾကမ္းေရးျခစ္"},{"word":"sketching","state":"v[ing]","def":"ပံုၾကမ္းေရးျခစ္ေန"},{"word":"sketchs","state":"n[pl]","def":"ပံုၾကမ္းမ်ား"},{"word":"skew","state":"v","def":"တိမ္းေခ်ာ္၊ေစာင္းပင္းေစသည္။ တိမ္းေခ်ာ္သည္။ ေခ်ာ္ေတာေငါ႔သည္။ လြေခ်ာ္ေသာ။ တိမ္းေစာင္းေသာ။ မဲတင္းေပးထားေသာ။ ဘက္လိုက္ထားေသာ။ အေမရိကန္ဧည့္သည္မ်ားအတြက္ေဇာင္းေပးထားေသာနတ္လမ္းညႊန္။ မတည့္ေသာ။ လိမ္ေသာ။ ရဲြ႔ေသာ။ ေစာင္းတေစာင္းေတာင္း။ အလဲြလဲြအေခ်ာ္ေခ်ာ္။"},{"word":"skewbald","state":"n","def":"အျဖဴႏွင့္အညို၊အုန္းခံြစသည္ကြက္က်ားျမင္း၊တိရစာၦန္။"},{"word":"skewer","state":"n","def":"တံစို႔။ သီတံ။ တံစို႔ထိုးသည္။ သီတံျဖင့္ထိုးသည္၊သီသည္။ တံက်င္လွ်ိဳသည္။ ထုတ္ခ်င္းေပါက္ထိုးမိသည္။"},{"word":"ski","state":"n","def":"စကီးေခၚႏွင္းေလွ်ာစီးပ်ဉ္ခ်ပ္တစ္ရန္အနက္မွတစ္ဖက္္။ ႏွင္းေလွ်ာစီး။ စကီး။ ႏွင္းေလွ်ာစီးသည္။ ငါႏွင္းေလွ်ာစီးရင္းသစ္ပင္ဝင္တိုးမိလို႔ေျခက်ိဳးသြားတယ္။ ဘီးအစားစကီးတပ္ထားေသာစက္ဘီးႏွင့္တူသည့္ႏွင္းေလွ်ာယာဉ္။ ႏွင္းေလွ်ာစီးသမား။ ႏွင္းေလွ်ာစီးျခင္း။ ယင္းအားကစား။ ကဆင္ေျခေလွ်ာအတိုင္းႏွင္းေလွ်ာစီး၍အဟုန္ျပင္းျပင္းျဖင့္လႊားခနဲခုန္ဆင္းႏိုင္ရန္စီမံထားသည့္နတ္လမ္းျပတ္။ ခယင္းသို႔ခုန္ခ်ကစားျခင္း။ ဂယင္းအခုန္ျပိဳင္ပဲြ။ ႏွင္းေလွ်ာစီးသူမ်ားကိုေတာင္ေစာင္းထက္သို႔တင္္ပို႔ေပးသည့္ကုလားထိုင္မ်ားအစီအရီပါသည့္ေရြ႔လ်ားစက္ခါးပတ္။"},{"word":"skid","state":"v","def":"ယာဉ္ဘီးေခ်ာ္သည္။ ေခ်ာေနေသာလမ္းေပၚတြင္အရိွန္ျဖင့္ေလွ်ာသြားသည္။ ဘီးေခ်ာ္ျခင္း။ ကြ်မ္းသႏၱာလန္ေအာင္အဆင္းတြန္းေပးလိုက္သည္။ ယာဉ္ေမာင္းမ်ားကားဘီးေခ်ာ္ျခင္းအေတြ႔အၾကံဳရေစရန္အထူးေခ်ာေအာင္ျပဳျပင္ထားသည့္တလင္းျပင္။ အေျခအေနမဲ့မ်ား၊အမူးသမားမ်ားစုေဝးရာဆင္းရဲသားရပ္ကြက္။"},{"word":"skies","state":"n[pl]","def":"ေကာင္းကင္"},{"word":"skilful","state":"adj","def":"ကြ်မ္းက်င္လိမၼာ"},{"word":"skilfully","state":"adv","def":"အလြန္ကြ်မ္းက်င္လိမၼာစြာ"},{"word":"skill","state":"n","def":"ကြ်မ္းက်င္မု"},{"word":"skilled","state":"adj","def":"ကြ်မ္းက်င္"},{"word":"skills","state":"n[pl]","def":"ကြ်မ္းက်င္မုမ်ား"},{"word":"skimish","state":"n","def":"စစ္သားအနည္းငယ္ျဖင့္ တိုက္"},{"word":"skin","state":"n","def":"အေရျပား"},{"word":"skins","state":"n[pl]","def":"အေရျပား"},{"word":"skirt","state":"n","def":"ဂါဝန္"},{"word":"skirts","state":"n[pl]","def":"ဂါဝန္မ်ား"},{"word":"skull","state":"n","def":"ဉီးေခါင္းခံြ"},{"word":"skulls","state":"n[pl]","def":"ဉီးေခါင္းခံြမ်ား"},{"word":"sky","state":"n","def":"ေကာင္းကင္"},{"word":"skylark","state":"n","def":"မိုးေဆြငွက္"},{"word":"skylarks","state":"n[pl]","def":"မိုးေဆြငွက္"},{"word":"skyline","state":"n","def":"မိုးကုတ္စက္ဝိုင္းတြင္ ေကာင္းေကာင္ကို ေနာက္ခံျပဳလ်က္ ျမင္ေတြ႔ရေသာ ေတာေတာင္ အေဆာက္အံုမ်ား၏ အနားသတ္မ်ဉ္း။"},{"word":"skyscraper","state":"n","def":"မိုးေမွ်ာ္တိုက္။ မိုးထိတိုက္။"},{"word":"skyward","state":"adv","def":"ေကာင္းကင္သို႔။"},
]}