{"data":[{"word":"slacks","state":"n","def":"ရိုးရိုးေဘာင္းဘီ"},{"word":"slag","state":"n","def":"သတၳဳေခ်း။"},{"word":"slang","state":"n","def":"ဗန္းစကား"},{"word":"slash","state":"n","def":"ဟက္တက္ခဲြျခင္း"},{"word":"slashs","state":"n[pl]","def":"ဟက္တက္ခဲြျခင္းမ်ား"},{"word":"sled","state":"n","def":"စြတ္ဖားလွည္း"},{"word":"sledge","state":"v","def":"စြတ္ဖား။ စြတ္ဖားစီးသည္။"},{"word":"sledge-hammer","state":"n","def":"လက္ကိုင္ရိုးရွည္တပ္တူၾကီး။ တူမ။"},{"word":"sleds","state":"n[pl]","def":"စြတ္ဖားလွည္းမ်ား"},{"word":"sleek","state":"adj","def":"ေခ်ာမြတ္ေတာက္ေျပာင္ေနေသာ။ တစ္ေသြးတစ္ေမြးျဖိဳးၾကြယ္ေသာ။ က်စ္လ်စ္ေၾကာ႔ေမာ႔ေသာ။"},{"word":"sleep","state":"n","def":"အိပ္စက္ျခင္း။ ညကသိပ္မအိပ္ရဘူး။ ဒီဆူညံသံေတြနဲ့အိပ္လို႔မရဘူး။ အိပ္ရင္းေယာင္ဖူးသလား။ အိပ္ေပ်ာ္ခ်ိန္။ အိပ္ခ်ိန္။ အိပ္သည္။ အိပ္ေပ်ာ္သည္။ အိပ္စရာေနရာ။ အိပ္စရာေနရာရိွသည္။ အိပ္ႏိုင္သည္။ တရႈပ္ရႈပ္ငိုရင္းအိပ္ေပ်ာ္သြားသည္။ ထံုလာသည္။ က်ဉ္လာသည္။ အသာေန၊သြားမဆြနဲ့။ ဆင္အိပ္ရာဆိတ္မနိႈးနဲ့။ ေမ့ေဆးေပးသည္။ ေဝဒနာသည္းေနေသာသတၱဝါအားကရုဏာျဖင့္ဇီဝိန္ေျခြလိုက္သည္။ လားပင္စင္ေပးသည္။ လိင္မႈေပြသည္။ အေႏြးထည္ခံထားျပီးလူတစ္ကိုယ္ဝင္အိပ္ႏိုင္သည့္အိတ္။ စခန္းခ်ရာတြင္သံုးေလ့ရိွသည္။ ရထားအိပ္ခန္းတဲြ။ ကုမၸဏီ၌ကိုယ္တိုင္အလုပ္ဝင္မလုပ္သည့္အစုရွယ္ယာရွင္။ အိပ္ေဆး။ ယာဉ္ကိုအရိွန္ေလွ်ာ႔ေမာင္းေအာင္ကတၱရာလမ္းမ၌ကန္႔လန္႔ခံထားသည့္လမ္းကန္သင္း။ ပူအိုက္စြတ္စိုေသာေဒသတြင္ေခၚမွက္တစ္မ်ိဳးကိုက္၍ျဖစ္ေသာေရာဂါ။ ေဝဒနာရွင္သည္အလြန္အိပ္ခ်င္လာျပီးေသႏိုင္သည္။ အိပ္မေပ်ာ္ေသာ။ အိပ္မရေသာ။ ကုလားေသကုလားေမာအိပ္သည္။ ေျပသြားေအာင္၊သက္သာေပ်ာက္ကင္းသြားေအာင္အိပ္ပစ္လိုက္သည္။ တစ္ညတာအခ်ိန္ယူစဉ္းစားျပီးေနာက္ေန့မွဆံုးျဖတ္သည္။ တျခားမွာအိပ္သည္။ ေတြ႔ကရာထိုးအိပ္သည္။ ေပ်ာ္ေအာင္အိပ္။ လင္မယားလိုေနသည္။"},{"word":"sleep","state":"v","def":"အိပ္စက္"},{"word":"sleeper","state":"n","def":"ကအအိပ္ၾကီး၊ပုပ္၊ဆိုး၊ၾကမ္း၊ဆတ္စသည့္သူ။ ခအိပ္ေနသူ။ ကအိပ္ခန္းတဲြပါညရထား။ ခဂယင္းတဲြရိွအိပ္စင္၊အိပ္စရာ။ ဇလီဖားတံုး။ လွ်ိဳေနရာမွေပါက္သြားသည့္စာအုပ္၊ျပဇာတ္၊ရုပ္ရွင္၊သီခ်င္းစသည္။"},{"word":"sleeping","state":"v[ing]","def":"အိပ္စက္ေန"},{"word":"sleeps","state":"v[sg]","def":"အိပ္စက္"},{"word":"sleepwalk","state":"v","def":"အိပ္ေပ်ာ္ေနစဉ္ေယာင္၍လမ္းထေလွ်ာက္သည္။"},{"word":"sleepy","state":"adj","def":"အိပ္ခ်င္ေသာ။ အိပ္ငိုက္ေသာ။ အိပ္ခ်င္မူးတူးျဖစ္ေနေသာ။ ႏြမ္းနယ္ေသာ။ မစည္ကားေသာ။ ေျခာက္ကပ္ကပ္။ အိပ္ခ်င္မူးတူးႏွင့္။"},{"word":"sleet","state":"n","def":"မိုးေရာႏွင္းပါ။ မိုးႏွင္း။ မိုးႏွင္းက်သည္။"},{"word":"sleeve","state":"n","def":"အက်ၤီလက္။ ဓာတ္ျပားစြပ္အိတ္။ အက်ၤီလက္ေသာ။ လိုခါထုတ္သံုးဖို႔အရန္သင့္ထားသည္။"},{"word":"sleeves","state":"n[pl]","def":"အကၤ်ီလက္မ်ား"},{"word":"sleigh","state":"n","def":"ျမင္းျဖင့္ဆဲြသည့္စြတ္ဖား။"},{"word":"sleight","state":"n","def":"လက္လွည့္။ မ်က္လွည့္။ ပဥၥလက္။ လွည့္စားမႈ။ ဥမ်က္လွည္္႔။"},{"word":"slender","state":"adj","def":"ကက်စ္လ်စ္ေသာ။ သြယ္ေသာ။ လ်ေသာ။ သိမ္ေသာ။ ခေသးသြယ္ေသာ။ မျဖစ္စေလာက္။ ပါးရွားေသာ။ သိုးကာသီကာမွ်။"},{"word":"slept","state":"v[pt]","def":"အိပ္စက္ခဲ့"},{"word":"slept","state":"v[pp]","def":"အိပ္စက္ခဲ့ျပီး"},{"word":"sleuth","state":"v","def":"လွ်ိဳဝွက္စြာ စံုစမ္းေထာက္လွမ္းသည္။"},{"word":"sleuth","state":"n","def":"စံုေထာက္။ ဦးရံွစား။"},{"word":"slew","state":"v","def":"လည္ထြက္သြားသည္။"},{"word":"slew","state":"n","def":"တစ္ပံုတစ္ေခါင္းၾကီး။"},{"word":"slice","state":"n","def":"အခ်ပ္။ အယွက္။ အစိတ္အပိုင္း။ အစုအဖို႔။ ေဂါက္သီးရိုက္ရာတြင္ညာသန္တစ္ဦးအတြက္ဘယ္မွညာသို႔ေဝ့ထြက္ေသာရိုက္ခ်က္။ အခ်ပ္လိုက္၊အလႊာလိုက္လီွးသည္။ လီွးသည္။ လႊာသည္။ သူကမာၻ႔စံခ်ိန္ကိုႏွစ္စကၠန္႔ခ်ိဳးလိုက္တယ္။ ဓားသြားစသည္ခဲြျဖတ္သြားသည္။ အထူးသျဖင့္ေဂါက္သီးဘယ္မွညာေဝ့ထြက္ေအာင္ရိုက္သည္။ ဘဝသရုပ္ေဖာ္စာေပ၊ရုပ္ရွင္၊ျပဇာတ္စသည္။"},{"word":"slice","state":"v","def":"အခ်ပ္လိုက္အလႊာလိုက္လီွး"},{"word":"sliced","state":"v[pt]","def":"အခ်ပ္လိုက္အလႊာလိုက္လီွးခဲ့"},{"word":"sliced","state":"v[pp]","def":"အခ်ပ္လိုက္အလႊာလိုက္လီွးခဲ့ျပီး"},{"word":"slices","state":"n[pl]","def":"အခ်ပ္မ်ား"},{"word":"slices","state":"v[sg]","def":"အခ်ပ္လိုက္အလႊာလိုက္လီွး"},{"word":"slicing","state":"v[ing]","def":"အခ်ပ္လိုက္အလႊာလိုက္လီွးေန"},{"word":"slick","state":"adj","def":"ကအထင္ၾကီးေလာက္ေအာင္၊မ်က္စိက်ေလာက္ေအာင္ျပရုပ္ေကာင္းေသာ။ သေဘာက်ေလာက္ေအာင္သြက္လက္ေသာ။ ခအလွည့္ေကာင္းေသာ။ နပ္ေသာ။ ေခ်ာေသာ။ ပင္လယ္၌ေရနံတင္သေဘၤာမွယိုဖိတ္သည့္ေရနံျပင္။ ဆံပင္ကိုဆီစသည္ျဖင့္ျဖီးသပ္သည္။ ပတ္ပတ္နပ္နပ္ရိွသူ။ အေပၚရံုမိုးကာရွည္။"},{"word":"slid","state":"v[pp]","def":"လီွးခဲ့ျပီး"},{"word":"slid","state":"v[pt]","def":"လီွးခဲ့"},{"word":"slide","state":"v","def":"ေလွ်ာဆင္းသည္။ ေခ်ာသည္။ ေခ်ာ္သည္။ သေဘၤာသည္ေရထဲသို႔ေလွ်ာဆင္းသြားသည္။ မသိမသာေရႊ႔သည္။ ခြ်တ္နင္းထြက္သည္။ လွ်ိဳဝင္သည္။ လွ်ိဳသြင္းသည္။ ေလွ်ာက်သည္။ တစ္စတစ္စနိမ္႔ပါးသည္။ ေရခေလွ်ာစီး။ ကေလးမ်ားကစားရန္ေလွ်ာ။ ေရခဲ၊ႏွင္းေလွ်ာစီးျပင္။ ေလွ်ာက်ျခင္း။ ဓာတ္ပံု၊ရုပ္ပံုဆလိုက္။ အဏုၾကည့္မွန္၌အရာဝတၳဳတို႔တင္ၾကည့္သည့္မွန္ခ်ပ္။ တူရိယာ၊ကိရိယာတို႔၌ဆဲြထုတ္ထိုးသြင္းႏိုင္ေသာအစိတ္အပိုင္း။ ေလွ်ာတံ။ ေရြ႔လ်ားႏိုင္ေသာအလယ္အဆံပါရိွျပီးေလာ္ဂရစ္သမ္တန္ဖိုးအမွတ္အသားမ်ားအားျဖင့္တြက္ခ်က္ရာတြင္အသံုးျပဳႏိုင္သည့္မ်ဉ္းတံ။ သခၤ်ာေပတံ။ ေလွ်ာတြက္တံ။ တြက္မ်ဉ္းတံ။ ဆဲြတံခါး။ တံခါးရြက္ကိုေလွ်ာေျမာင္းတစ္ေလွ်ာက္ဆဲြျပီးဖြင့္ပိတ္ရသည္။ အေျခအေနေပၚမူတည္၍အခ်ိဳးေျပာင္းလဲသြားႏိုင္သည့္နႈန္းထား။"},{"word":"slides","state":"v[sg]","def":"လီွး"},{"word":"sliding","state":"v[ing]","def":"လီွးေန"},{"word":"slight","state":"adj","def":"ကအနည္းငယ္။ ခေပါ႔တန္ေသာ။ မေလးနက္ေသာ။ သူ႔အရင္လက္ရာနဲ့စာရင္ဒီဝတၳဳကနည္းနည္းေပါ႔တယ္။ သြယ္လ်ေသာ။ ပါးလ်ေသာ။ နည္းနည္းကေလးမွ်။ လံုးဝ။ အနည္းငယ္။ နည္းနည္းပါးပါး။ ပါးပါးလ်လ်။ သြယ္သြယ္လ်လ်။ ပစ္ေတာင္းဆန္ခါဆက္ဆံသည္။ အရွက္ခဲြသည္။ ေစာ္ကားမႈ။"},{"word":"slighter","state":"adj[com]","def":"အနည္းငယ္"},{"word":"slightest","state":"adj[sup]","def":"အနည္းငယ္"},{"word":"slightly","state":"adv","def":"အနည္းငယ္"},{"word":"slim","state":"adj","def":"က်စ္လ်စ္ေသာ။ ေသးသြယ္ေသာ။ ပါးလ်ေသာ။ အလားအလာစသည္နည္းပါးေသာ။ သက္ေသသကၠာယမခိုင္မာေသာ။ သက္ေသလံုေလာက္မႈမရိွဘဲနဲ့ျပစ္ဒဏ္ခ်မွတ္လိုက္တယ္။ ပိန္ေအာင္ေလ့က်င့္ခန္းလုပ္ျပီးေလွ်ာ႔စားသည္။ က်စ္လ်စ္ေအာင္လုပ္သည္။ ေလွ်ာ႔ခ်သည္။ ခ်ံဳ႕သည္။ ပိန္ေအာင္ေလွ်ာ႔စားေနသူ။ ကိုယ္အေလးခ်ိန္ေလွ်ာ႔ခ်ျခင္း။"},{"word":"slime","state":"n","def":"အက်ိအခြ်ဲက်ိခြ်ေသာ။ ခြ်ဲခြ်ဲပ်စ္ပ်စ္ဖားလြန္းေသာ။ ရံြစရာေကာင္းေလာက္ေအာင္မ်က္ႏွာခ်ိဳေသြးလြန္းေသာ။"},{"word":"slimline","state":"adj","def":"ပံုပန္းက်စ္လ်စ္ေသသပ္ေသာ။"},{"word":"sling","state":"n","def":"ဒဏ္ရာရလက္ကိုပင့္မထားရန္လည္သိုင္းပတ္တီး။ ကအရာဝတၳဳမ်ားကိုသယ္ရန္၊ဆဲြပင့္ရန္သံုးသည့္သိုင္းၾကိဳး၊လြယ္ၾကိဳး၊ၾကိဳးသိုင္းစသည္။ ခကေလးငယ္ခ်ီပိုးရာတြင္သံုးသည့္အသိုင္း။ ေရွးေက်ာက္တံုးမ်ားျဖင့္ပစ္ခတ္ရာတြင္သံုးသည့္ေလာက္လဲႊ။ ပစ္ေပါက္သည္။ လဲႊပစ္သည္။ ပစ္ထည့္သည္။ ဆဲြထုတ္သည္။ ခ်ိတ္ဆဲြသည္။ လြယ္သည္။ ထြက္သြား။"},{"word":"slink","state":"v","def":"ကုပ္ေခ်ာင္းကုပ္ေခ်ာင္းသြားသည္၊လာသည္။ အျမီးကုပ္သြားသည္။ နဲြ႔ေနာင္းေသာ။ ညက္ေညာေသာ။ ညုေသာ။ အမ်ိဳးသမီးဝတ္စံုခႏၶာကိုယ္အခ်ိဳးအဆစ္တို႔ပံုေပၚေအာင္ခ်ပ္ခ်ပ္ရပ္ရပ္ရိွေသာ။"},{"word":"slip","state":"v","def":"ကေျခေခ်ာ္သည္။ ခေခ်ာ္သည္။ ေလွ်ာသည္။ သိုင္းၾကိဳးကပခံုးကေနေလွ်ာေလွ်ာက်တယ္။ ဂလြတ္က်သည္။ ေလွ်ာက်သည္။ လြတ္ထြက္သည္။ ေျပာဖို႔ေတာ႔မရည္ရြယ္ပါဘူး၊ဒါေပမဲ့လႊတ္ခနဲထြက္သြားမိတယ္။ ဃေခ်ာ္သည္။ ေလ်ာ႔သည္။ က်ဆင္းသည္။ ေနာက္က်သည္။ သတိမမူမိ။ သတိမရ။ မစဉ္းစားမိ။ ညံ့လာသည္။ လွ်ိဳ၍ဝင္လာသည္၊ထြက္သြားသည္။ လစ္သြားသည္။ ႏွစ္ေတြကုန္မွန္းမသိကုန္လြန္ခဲ့သည္။ မသိမသာထည့္သည္။ ေကာက္ဝတ္သည္။ ခြ်တ္ပစ္သည္။ ေခ်ာ္ျခင္း။ တစ္ခ်က္ေခ်ာ္လိုက္တာနဲ့ကမ္းပါးကေနေအာက္ထဲက်သြားမယ္။ ခြ်တ္ေခ်ာ္မႈ။ အေသးအဖဲြမွားယြင္းမႈ။ စာရြက္အတိုအစ။ ျဖတ္ပိုင္း။ အမ်ိဳးသမီးအတြင္းခံသင္တိုင္းသို႔အတြင္းခံစကတ္။ ခရစ္ကက္တြင္ရိုက္လွည့္က်သဴ၏ေနာက္သို႔ေဘးတေစာင္းမွေဘာလံုးကိုဖမ္းရန္ေစာင့္သူ။ ယင္းယူထားသည့္ေနရာ။ လိုက္သူကိုလွည့္ပတ္၍လြတ္ေအာင္ေျပးသည္။ အခြင့္အေရးလက္လႊတ္သည္၊လက္လြတ္ခံသည္။ လႊတ္ခနေျပာမိသည္သို႔စကားရိပ္သန္းသည္။ အခြင့္အေရးစသည္တစ္စတစ္စလက္လြတ္ဆံုးရံႈးသည္။ ကြင္းေလွ်ာ။ ပါးပါးလွပ္လွပ္လုလင္၊လံုမေလး။ ပမာဒေလခသို႔လႊတ္ခနေျပာမိျခင္း။ ကြင္းထိုးဖိနပ္။ ခါးဆစ္လဲြျခင္း။ အျမန္လမ္းမၾကီးသို႔ဝင္ရန္၊မွထြက္ရန္လမ္းခဲြ။ ကြန္ရက္ကိုေက်ာ္ျဖတ္လြတ္ေျမာက္သည္။ ခြ်တ္ေခ်ာ္သည္။ နေမာ္နမဲ့အမွား။ ေပါ႔တီးေပါ႔ဆအမွား။ ခြ်တ္ေခ်ာ္တိမ္းပါးမႈ။"},{"word":"slip","state":"n","def":"ကလစ္"},{"word":"slippage","state":"n","def":"တစ္စတစ္စေလ်ာ႔နည္းျခင္း၊က်ဆင္းျခင္းး။ ရည္မွန္းခ်ိန္ထက္ေနာက္က်၍ျပီးစီးျခင္း။"},{"word":"slipper","state":"n","def":"အိမ္တြင္းစီးေပါ႔ပါးသည့္ကြင္းထိုးဖိနပ္။ ကြင္းထိုးဖိနပ္စီးထားေသာ။"},{"word":"slipper orchid","state":"n","def":"ဂမုန္းသစ္ခြ"},{"word":"slippers","state":"n[pl]","def":"ညွပ္ဖိနပ္မ်ား"},{"word":"slippery","state":"adj","def":"ေခ်ာေသာ။ ေခ်ာ္ေသာ။ မယံုရေသာ။ စိတ္မခ်ရေသာ။ ရႈပ္ေထြးသိမ္ေမြ႔ျပီးကိုင္တြယ္ရန္မလြယ္ကူေသာ။ က်ားျမီးဆဲြမိသလိုကိစၥမ်ိဳး။"},{"word":"slips","state":"n[pl]","def":"ကလစ္မ်ား"},{"word":"slipshod","state":"adj","def":"ေပါ႔ေပါ႔ဆဆ။ ကေရာ္ကမည္ႏိုင္ေသာ။"},{"word":"slipway","state":"n","def":"လြန္းက်င္း၌သေဘၤာတင္၊ခ်ရန္လမ္းေလွ်ာ။"},{"word":"slit","state":"n","def":"ဟက္တက္ရာ။ အကဲြ။ အဟ။ လီွးရာ။ ၁လီွးသည္။ ခဲြသည္။"},{"word":"slither","state":"v","def":"ကဖည္ယမ္းလ်က္ေလွ်ာတိုက္သြားသည္။ ခကိုယ္ကိုတြန္႔ျပီးတြားသြားသည္။ ေျမြလိမ္ေျမြေကာက္တြားသြားသည္။ တြားတက္သည္။ ေခ်ာက်ေနေသာ။ ေခ်ာ္ေသာ။"},{"word":"sliver","state":"n","def":"အစ။ စ။"},{"word":"slob","state":"n","def":"ပ်င္းေသာ၊ရိုင္းေသာ၊အဝတ္အစားဖိုသီဖတ္သီႏိုင္ေသာသူ။ ဘုတ္ထိုင္း။"},{"word":"slobber","state":"v","def":"သြားရည္ယိုသည္။ မ်က္စေနာက္ေလာက္ေအာင္အငမ္းမရျဖစ္သည္။ သူမင္းကိုခ်စ္မွန္းသိပါတယ္၊ဒါေပမဲ့လူေရွ႕သူေရွ႕မွာဒါေလာက္ဣေျႏၵမဲ့ရလား။"},{"word":"sloe","state":"n","def":"မက္မန္းသီး။"},{"word":"slog","state":"v","def":"ေဘာလံုးကိုတအားစြတ္ရိုက္သည္။ မျငီးတမ္း၊မပ်င္းတမ္းေခါင္းမေဖာ္ဘဲလုပ္သည္။ တစ္လွမ္းခ်င္းပင္ပင္ပန္းပန္းေလွ်ာက္လွမ္းသည္။ ခရစ္ကက္ျပင္းေသာရိုက္ခ်က္။ ကုန္းရုန္းလုပ္ရသည့္အလုပ္။ အရံႈးအႏိုင္ေပၚသည္အထိအၾကိတ္အနယ္နဲႊသည္။"},{"word":"slogan","state":"n","def":"ႏိုင္ငံေရးေၾကြးေၾကာ္သံ။ ေၾကာ္ျငာေဆာင္ပုဒ္။"},{"word":"sloop","state":"n","def":"တစ္ပင္တိုင္ရြက္သေဘၤာငယ္တစ္မ်ိဳး။"},{"word":"slop","state":"v","def":"ကအရည္ဖိတ္က်သည္၊လွ်ံက်သည္။ ခငဲွ႕သည္။ သြန္သည္။ ဖိတ္သည္။ စားၾကြင္းစားက်န္ဝက္စာ။ ေရဆိုး။ အရည္သက္သက္ဓာတ္စာမ်ိဳး။ ေဘာင္ဘင္ခတ္သည္။ ေထာင္ထဲတြင္က်င္ငယ္အိုးသြန္သည္။"},{"word":"slope","state":"n","def":"ကကုန္းေစာင္း။ ဆင္ေျခေလွ်ာ။ ကုန္းတက္။ ကုန္းေမာ႔။ ကုန္းဆင္း။ ကုန္းေလွ်ာ။ ခေတာင္ေစာင္း။ ဆင္ေျခေလွ်ာ။ ¹ေလွ်ာသည္။ ေစာင္းသည္။ မင့္လက္ေရးဘယ္ေစာင္းသလား၊ညာေစာင္းသလား။ အသာလစ္သြားသည္။"},{"word":"sloppy","state":"adj","def":"ျဖစ္ကတတ္ဆန္းႏိုင္ေသာ။ ေပါ႔ေပါ႔တန္တန္ႏိုင္ေသာ။ မသပ္ရပ္ေသာ။ ေလ်ာ႔ရေလ်ာ႔ရဲျဖစ္ေသာ။ ယုတၱိကင္းမဲ့စြာအလြမ္းသယ္ေနေသာ။ က်ေတာက္ေတာက္။ မိန္းကေလးကတံေတြးစိုစိုရဲႊရဲႊႏွင့္ျပြတ္ခနဲသူ႔ကိုတအားဖက္နမ္းလိုက္တယ္။"},{"word":"slosh","state":"v","def":"ကေဘာင္ဘင္ခတ္သည္။ ခစိုရႊေအာင္ပက္သည္၊ေလာင္းသည္၊ဖိတ္သည္။ ေရ၊အရည္ထဲ၌တစြက္စြက္ျမည္လ်က္လွမ္းသြားသည္။ အရက္မူးေနေသာ။"},{"word":"slot","state":"n","def":"ကတ္ျပား၊ဒဂၤါးျပားစသည္ထည့္ရန္အေပါက္္။ တစ္စံုတစ္ရာထည့္ရန္၊ေျပးရန္အကြက္၊အေပါက္၊ေျမာင္း။ စာရင္း၊ဇယားတြင္အဆင့္၊ေနရာ။ အံ၊အကြက္၊အေပါက္၊ေျမာင္းထဲသို႔အလိုက္သင့္သြင္းသည္။ ျပြန္ေခ်ာင္းေတြကိုဒီလိုတစ္ခုႏွင့္တစ္ခုအံကိုက္တပ္ရတယ္။ အေပါက္ထဲပိုက္ဆံထည့္လိုက္လွ်င္ပစၥည္းထြက္လာသည့္ေဈးေရာင္းစက္။ အေပါက္၊ေျမာင္းစသည္ထြင္းထားေသာ။"},{"word":"sloth","state":"n","def":"ပ်င္းရိျခင္း။ ထိန။ ပ်င္းရေသာ။ ေမ်ာက္ေမာင္းမ။ ဆေလာ႔။"},{"word":"slouch","state":"v","def":"ေပ်ာ႔တေပ်ာ႔ေခြေနသည္။ အလြန္ေတာ္ေသာ၊သြက္ေသာ။"},{"word":"slough","state":"n","def":"ရံႊ႔ေတာဗြက္ေတာ။ စိတ္ဓာတ္ဒုတ္ဒုတ္ထိက်ျခင္း။ အေရခံြလဲသည္၊ခြာသည္။ ခါထုတ္သည္။"},{"word":"slovenly","state":"adj","def":"ဖိုသီဖတ္သီ၊မသပ္မရပ္၊ကေပကေရဝတ္ပံုစားပံု၊အမူအက်င့္။ ျဖစ္ကတတ္ဆန္း၊ေပါက္လႊတ္ပဲစား၊ေပါ႔ေပါ႔တန္တန္အလုပ္။"},{"word":"slow","state":"adj","def":"ေႏွးေသာ။ ၾကာေသာ။ ဉာဏ္ထိုင္းေသာ။ ထံုေသာ။ ၾကန္႔ၾကာေသာ။ ေလးကန္ေသာ။ ေႏွာင့္ေႏွးေသာ။ မသြက္ေသာ။ ထိုင္းေသာ။ ဥေအးေသာ။ ေႏွးေသာနာရီ။ ၃အေႏွးယာဉ္၊လမ္းစသည္။ ၁ခအလင္းေရာင္ႏွင့္တံု႔ျပန္ရာ၌ေႏွးေသာဓာတ္ပံုဖလင္။ ၄ေႏွးေႏွး။ ျဖည္းျဖည္းခ်င္း။ အရိွန္ေလွ်ာ႔ခ်သည္။ ဖင့္ေႏွးသည္။ အလုပ္သမားမ်ားဆႏၵျပသည့္အေနျဖင့္အလုပ္ကိုတမင္ေႏွးေႏွးလုပ္သည္။ ျဖည္းျဖည္းျဖည္းျဖည္းလုပ္သည္။ စိတ္မပါ႔တပါႏွင့္တရြတ္ဆဲြလိုက္ေနသည္။ အလုပ္ေလာမၾကီးႏွင့္။ ေအးေအးသက္သာလုပ္။ ေႏွးေႏွး။ ျဖည္းျဖည္းခ်င္း။ သေႏၷသေႏၷ။ ျဖည္းျဖည္းႏွင့္မွန္မွန္။ ရုပ္ရွင္၊ဗီဒီယိုအေႏွးရိုက္ခ်က္၊ျပကြက္။"},{"word":"slowcoach","state":"n","def":"ဖင္ေလးဖင္ကန္။ စိတ္ေပါက္မွလိပ္ေလာက္ေျပးသူ။ (UK)"},{"word":"slowpoke","state":"n","def":"ဖင္ေလးဖင္ကန္။ စိတ္ေပါက္မွလိပ္ေလာက္ေျပးသူ။ (US)"},{"word":"slug","state":"n","def":"ပက္က်ိ"},{"word":"slugs","state":"n[pl]","def":"ပက္က်ိမ်ား"},
]}