{"data":[{"word":"snail","state":"n","def":"ခရု"},{"word":"snails","state":"n[pl]","def":"ခရုမ်ား"},{"word":"snake","state":"n","def":"ေျမြ"},{"word":"snakes","state":"n[pl]","def":"ေျမြမ်ား"},{"word":"snapdragon","state":"n","def":"က်ားပါးစပ္ပန္း။"},{"word":"snare","state":"n","def":"ညႊတ္။ ေက်ာ႔ကြင္း။ ဥညႊတ္ကြင္း။ ေက်ာ႔ကြင္း။ ေထာင္ေခ်ာက္။ ညႊတ္ေထာင္သည္။ ေထာင္ဖမ္းသည္။ စနဲဗံု။ ေအာက္မ်က္ႏွာဝတြင္သတၱဳၾကိဳးမ်ားတန္းထားသျဖင့္ေခါက္ျပီးေနာက္အသံဆက္လက္တုန္ယင္ထြက္သည္။"},{"word":"snarl","state":"v","def":"ေခြးစသည္အစြယ္ျပျပီးမာန္ဖီသည္။ ဟိန္းေဟာက္သည္။ ေဒါသျဖင့္ၾကိမ္းဝါးသည္။ မာန္ဖီျခင္း။ ဟိန္းျခင္း။ ေထြးျခင္း။ ရႈပ္ျခင္း။ ထံုးျခင္း။ အေထြးအလံုး။ အထံုး။ လံုးေထြးသြားသည္။ ရႈပ္ကုန္သည္။ ပိတ္ဆို႔ကုန္သည္။ ယာဉ္ေၾကာပိတ္ဆို႔မႈ။"},{"word":"snatch","state":"v","def":"ကဆတ္ခနဲဆဲြယူသည္၊လုယူသည္။ ခဆတ္ခနဲဖယ္သည္၊ရုပ္သည္။ အလစ္သုတ္သည္။ အေျခအေနေပးခိုက္အခြင့္အေရးကိုအျမန္ရယူသည္။ တစ္နာရေလာက္လုအိပ္လိုက္တယ္။ သူတို႔ပဲြျပီးခါနီးမွေတ့ျပီးအလုအယက္ၾကိဳးစားအႏိုင္ယူလိုက္ၾကတယ္။ ကသီခ်င္း၊စကား၊ရုပ္ရွင္စသည္အပိုင္းအစ။ ခထံု႔ပိုင္းထံု႔ပိုင္း။ ဆတ္ခနဲယူငင္ျခင္း။ လက္ျဖင့္လွမ္းယူသည္။ အရယူရန္သဲသဲမဲမဲၾကိဳးပမ္းသည္။ လုေျပးသူ။ အလစ္သုတ္သမား။"},{"word":"snazzy","state":"adj","def":"အဝတ္အထည္စသည္ေခတ္မီသပ္ရပ္လွပေသာ။"},{"word":"sneak","state":"v","def":"ကေလးခ်င္းခ်င္းအေၾကာင္းလူၾကီးထံ၌အတို႔အေထာင္လုပ္သည္။ ခိုးယူသည္။ ခိုးလုပ္သည္။ ခိုးေၾကာင္ခိုးဝွက္ဝင္လာသည္၊လစ္သြားသည္စသည္။ သတၱေၾကာင္သည့္ကလိမ္ကက်စ္အထူးသျဖင့္အတို႔အေထာင္သတင္းေပး။ ေရွာင္တခင္။ ခံစားခ်က္က်ိတ္၍၊မဝံ့တဝံ့ျဖစ္ေနေသာ။ ၁ခရုပ္ရွင္၊ျပပဲြစသည္သီးသန္႔အၾကိဳပဲြ။ အလစ္သုတ္သမား။ တိတ္တဆိတ္ခ်ဉ္းကပ္သြားသည္။ ခိုးေၾကာင္ခိုးဝွက္လုပ္ေသာ၊ျဖစ္ေသာ။"},{"word":"sneaker","state":"n","def":"အားကစားဖိနပ္"},{"word":"sneakers","state":"n","def":"အားကစားဖိနပ္မ်ား"},{"word":"sneer","state":"v","def":"ေလွာင္သည္။ သေရာ္သည္။ သေရာ္ျပံဳးျပံဳးသည္။ ေလွာင္ရယ္ရယ္သည္။ အထင္ေသးေၾကာင္းကိုျပသည့္အၾကည့္၊အျပံဳး၊အေျပာ၊စကားရပ္စသည္။"},{"word":"sneeze","state":"n","def":"ႏွာေခ်ျခင္း။ ႏွာေခ်သည္။ ေပါ႔ေသးေသးမဟုတ္။"},{"word":"snicker","state":"v","def":"က်ိတ္ရယ္သည္။ က်ိတ္ရယ္သူ"},{"word":"snide","state":"adj","def":"မထိတထိရႈတ္ခ်ေသာ။ လက္သီးပုန္းထိုးေသာ။"},{"word":"sniff","state":"v","def":"ႏွာရႈပ္သည္။ ကရႉသည္။ နမ္းသည္။ ခႏွာေခါင္းကရႉသြင္းသည္။ ဂမူးယစ္ေဆးဝါးစသည္ရႉသည္။ ကငိုမဲ့မဲ့ေျပာသည္။ ခမာနသံႏွင့္၊မႏွစ္သက္ဟန္ႏွင့္မဲ့မဲ့ရဲြ႔ရဲြ႔ေျပာသည္။ ႏွာရႈပ္ျခင္း။ ယင္းအသံ။ တစ္ရႉ၊တစ္ရိႈက္။ အနံ့အသက္ရသည္ႏွင့္။ ဂရုမစိုက္၊အထင္ေသးသည္။ လူရွာေဖြေဖာ္ထုတ္သည္။ အနံ့ခံေခြး။"},{"word":"sniffle","state":"v","def":"ႏွာတရႈပ္ရႈပ္ျဖစ္သည္။ ႏွာရႈပ္ျခင္း။ ႏွာရႈပ္သံ။ အေအးမိသည္။ အေအးပတ္သည္။"},{"word":"sniffy","state":"adj","def":"ႏွာေခါင္းရံႈ႔ေသာ။"},{"word":"snifter","state":"n","def":"အရက္တစ္ေမာ႔။"},{"word":"snigger","state":"n","def":"ေငါ႔၍တိုးတိုးရယ္ျခင္း။ ေလွာင္ရယ္သည္။"},{"word":"snip","state":"v","def":"ကိုက္သည္။ ညွပ္သည္။ ကိုက္ျခင္း။ ညွပ္ျခင္း။ ေလွ်ာ႔ေဈး။"},{"word":"snipe","state":"n","def":"စႏိုက္ငွက္။ ဗိုလ္စားငွက္။ ေခ်ာင္းပစ္သည္။ အပုပ္ခ်သည္။ ေခ်ာင္းပစ္သူ။ လက္ေျဖာင့္။"},{"word":"snippet","state":"n","def":"သတင္း၊အခ်က္အလက္အတိုအထြာ။"},{"word":"snivel","state":"v","def":"ကတရႈပ္ရႈပ္ငိုသည္။ ခညည္းညူသည္။ ခ်ဴသံပါေအာင္ညည္းေသာ။"},{"word":"snob","state":"n","def":"ကအထက္ဖားေအာက္ဖိ။ မ်က္ႏွာၾကီးရာဟင္းဖတ္ပါလူစား။ ငဖား။ အနားျပာ။ ခလူတတ္ၾကီး။ ဆရာၾကီး။ ေသြးၾကီးေမြးၾကီးႏိုင္သူ။ ေသြးၾကီးေမြးၾကီးႏိုင္ျခင္း။ ဘဝင္ကိုင္ျခင္း။ ဇီဇာေၾကာင္ေသာ။ ဇီဇာေၾကာင္ျခင္း။"},{"word":"snog","state":"v","def":"ဖက္နမ္းသည္။ ဖက္နမ္းျခင္း။"},{"word":"snooker","state":"n","def":"ကဘိလိယက္ခံုေပၚတြင္အနေဘာလံုးတစ္ဆယ္႔ငါးလံုး၊အေရာင္ကြေျခာက္လံုးအျဖဴထိုးေဘာတစ္လံုးတို႔ျဖင့္ကစားနည္း။ စႏူကာ။ ၃ခစႏူကာကစားရာ၌ျပိဳင္ဘက္ထိုးလွည့္တြင္ထိုးေပါက္ပိတ္ေအာင္ထိုးေဘာကိုဆစ္ထားသည့္အေနအထား။ တစ္ဖက္သားထိုးခြင့္မသာေအာင္ဆစ္ထားလိုက္သည္။ ဥခြက်ေအာင္ဆစ္ထားသည္။"},{"word":"snoop","state":"v","def":"ေခ်ာင္းသည္။ ခိုးၾကည့္သည္။ ေခ်ာင္းၾကည့္သူ။ ခိုးၾကည့္သူ။"},{"word":"snooty","state":"adj","def":"ေသြးၾကီးေမြးၾကီးႏိုင္ျခင္း။ ဘဝင္ျမင့္ျခင္း။ ေသြးၾကီးေမြးၾကီးႏိုင္ေသာ။ အဖက္မတန္သေဘာထားေသာ။"},{"word":"snooze","state":"v","def":"တစ္ေရးေမွးသည္။ မိွန္းသည္။ တစ္ေမွးအိပ္ျခင္း။"},{"word":"snore","state":"v","def":"တေခါေခါႏွင့္ေဟာက္သည္။"},{"word":"snore","state":"n","def":"ေဟာက္သံ။"},{"word":"snorer","state":"n","def":"အိပ္သည့္အခါ ေဟာက္တတ္သူ။"},{"word":"snoring","state":"v","def":"အိပ္ရာတြင္ ေဟာက္သည္။"},{"word":"snorkel","state":"n","def":"ေရေအာက္အသက္ရႉပိုက္။ ယင္းပိုက္ကိုသံုးရသည့္ေရေအာက္အားကစားျပိဳင္ပဲြ။"},{"word":"snort","state":"v","def":"ကႏွာမႈတ္သည္။ ႏွာျဖဳပ္သည္။ ခ̏ဟြန္း˝ဟုအသံျပဳ၍သေရာ္သည္၊ေလွာင္သည္၊ေငါ႔သည္။ ကိုကင္းရႉသည္။ ႏွာမႈတ္ျခင္း။ ႏွာမႈတ္သံ။ ကိုးကင္းတစ္ရႈ၊တစ္ရိႈက္။"},{"word":"snot","state":"n","def":"ႏွပ္။ ႏွပ္ေခ်း။ ႏွပ္ေခ်းဖတ္။ ႏွပ္ေခ်းတဲြလဲႏွင့္။ ႏွပ္ထူလပ်စ္ႏွင့္။ မတူမတန္သေဘာျဖင့္တင္စီးေသာ။ ေသြးၾကီးေသာ။ ဟိတ္ၾကီးဟန္ၾကီးလုပ္ေသာ၊ႏိုင္ေသာ။"},{"word":"snout","state":"n","def":"နႈတ္သီး။ ေသနတ္ေျပာင္း။ ႏွာေခါင္း။"},{"word":"snow","state":"n","def":"ႏွင္း။ ႏွင္းခဲ။ ႏွင္းပြင့္။ ႏွင္း။ ဆီးႏွင္း။ ႏွင္းက်သည္။ လိႈင္းသည္။ ႏွင္းဖံုးေနေသာ။ ႏွင္းလႊမ္းေသာ။ ႏွင္းခိုသည္။ ပေနသည္။ ႏွင္းလႊမ္း၍ပိတ္ေနသည္။ ဆြတ္ဆြတ္ျဖဴ။ ကႏွင္းဖံုးေနေသာ။ ခႏွင္းက်ေသာ။ ႏွင္းထူေသာ။ ႏွင္းကဲ့သို႔ျဖဴေဖြးေသာ။ ေငြႏွင္းျဖဴ။"},{"word":"snowball","state":"n","def":"ပစ္ေပါက္ကစားသည့္ႏွင္းေဘာလံုး၊ႏွင္းဆုပ္လံုး။ ခဏခ်င္းၾကီးထြားျခင္း။ တစ္မုဟုတ္ခ်င္းၾကီးထြားျပင္းထန္လာသည္။ ႏွင္းဆုပ္လံုးျဖင့္ပစ္ေပါက္ကစားသည္။"},{"word":"snowblower","state":"n","def":"ႏွင္းက်ံဳးမႈတ္ဖယ္စက္။"},{"word":"snowbound","state":"adj","def":"ႏွင္းပိတ္ေနေသာ။"},{"word":"snowcapped","state":"adj","def":"အထြတ္ကိုႏွင္းလႊမ္းေသာ။"},{"word":"snowdrift","state":"n","def":"ေလတိုက္၍ျဖစ္ေသာႏွင္းခဲပံု။"},{"word":"snowdrop","state":"n","def":"ႏွင္းေခါင္းေလာင္းပန္း။"},{"word":"snowfall","state":"n","def":"ကဆီးႏွင္းက်ျခင္း။ ခက်သည့္ဆီးႏွင္းပမာဏ။"},{"word":"snowfield","state":"n","def":"အျမဲတမ္းဆီးႏွင္းျပင္။"},{"word":"snowflake","state":"n","def":"ဆီးႏွင္းပြင့္။"},{"word":"snowline","state":"n","def":"အျမဲတမ္းဆီးႏွင္းျပင္အနားသတ္မ်ဉ္း။"},{"word":"snowplough","state":"n","def":"ဆီးႏွင္းရွင္းေဂၚသို႔ယာဉ္"},{"word":"snows","state":"n[pl]","def":"ႏွင္းမ်ား"},{"word":"snowshoe","state":"n","def":"ႏွင္းေတာစီးဖိနပ္။"},{"word":"snowstorm","state":"n","def":"ႏွင္းမုန္တိုင္း။"},{"word":"snowstorms","state":"n[pl]","def":"ႏွင္းမုန္တိုင္းမ်ား"},{"word":"SNP","state":"abbr","def":"စေကာ႔တလန္အမ်ိဳးသားပါတီ"},{"word":"snub","state":"v","def":"ကအဖက္မတန္သလိုဥေပကၡာျပဳသည္သို႔နင့္နာေအာင္ေျပာသည္။ ခဖိတ္ၾကားသည္ကိုအေရးမစိုက္။ ပစ္ပယ္သည္။ ပမာမခန္႔ျပဳျခင္း။ မ်က္ႏွာပ်က္ေအာင္လုပ္ျခင္း။ တို၍ထိပ္လန္ေနေသာႏွာေခါင္း။"},{"word":"snuff","state":"v","def":"ဖေယာင္းတိုင္မီးကိုျငိွမ္းသည္။ ေသသည္။ ၾကြသည္။ ဇီဝိန္ခ်ဳပ္သည္။ သတ္ပစ္သည္။ ႏွာ။"},{"word":"snuffbox","state":"n","def":"ႏွာဘူး။"},{"word":"snuffle","state":"v","def":"ကတိရစာၦန္တရႈပ္ရႈပ္လုပ္သည္။ ခႏွာမႊန္သည္။ ႏွပ္ရႈပ္သည္။"},{"word":"snug","state":"v.t","def":"ေခ်ာမြတ္ေစသည္။ ပူးကပ္ရိပြတ္သည္။"},
]}