{"data":[{"word":"space","state":"n","def":"ေနရာလပ္"},{"word":"Space Craft","state":"n","def":"အာကာသယာဉ္"},{"word":"space ship","state":"n","def":"အာကာသယာဉ္"},{"word":"space station","state":"n","def":"အာကာသစခန္း"},{"word":"spaces","state":"n[pl]","def":"ေနရာလပ္မ်ား"},{"word":"spade","state":"n","def":"ေဂၚျပား"},{"word":"spades","state":"n[pl]","def":"ေဂၚျပားမ်ား"},{"word":"spare","state":"adj","def":"အရန္"},{"word":"spare","state":"n","def":"အပို"},{"word":"sparer","state":"adj[com]","def":"အရန္"},{"word":"spares","state":"n[pl]","def":"အပိုမ်ား"},{"word":"sparest","state":"adj[sup]","def":"အရန္"},{"word":"sparkling","state":"n","def":"စပါကလင္"},{"word":"sparrow","state":"n","def":"စာကေလး"},{"word":"sparrows","state":"n[pl]","def":"စာကေလးမ်ား"},{"word":"sparse","state":"adj","def":"က်ေသာ။ ပါးေသာ။ နည္းေသာ။ က်ဲက်ဲ။ က်ိဳးတိုးက်ဲတဲ။ မည္ကာမတၱ။"},{"word":"spartan","state":"adj","def":"က်ပ္က်ပ္တည္းတည္းႏိုင္ေသာ။ တင္းတင္းက်ပ္က်ပ္ႏိုင္ေသာ။ ျခိဳးျခံေသာ။"},{"word":"spasm","state":"n","def":"လွ်ပ္တစ္ျပက္ျဖစ္ရပ္။ တဒဂၤမွ်ျဖစ္ျခင္း။ ဖ်တ္ခနေပၚေပါက္မႈ။ အေၾကာဆဲြျခင္း။ ဖ်တ္ခနဲရုန္းျခင္း။ ဆန္႔ငင္ဆန္႔ငင္ျဖစ္ျခင္း။"},{"word":"spasmodic","state":"adj","def":"ျပတ္ေတာင္းျပတ္ေတာင္း၊ၾကိဳးၾကားၾကိဳးၾကားျဖစ္ေသာ၊လုပ္ေသာ။ မထိန္းမသိမ္းႏိုင္ေသာ။ တဟြတ္ဟြတ္ေခ်ာင္းဆိုးျခင္း။ တစ္ခ်ီတစ္ခ်ီ။ တစ္ခ်က္တစ္ခ်က္။"},{"word":"spastic","state":"adj","def":"သြက္ခ်ာပါဒေဝဒနာခံစားေနရေသာ။ သြက္ခ်ာပါဒေဝဒနာသည္။"},{"word":"spat","state":"n","def":"ကေတာက္ကဆတ္။ ယခင္ကရႉးဖိနပ္အထက္ေျခခ်င္းဝတ္လံုေအာင္ပတ္ရေသာေျခပတ္။"},{"word":"spate","state":"n","def":"ရုတ္ျခည္းတစ္သြန္တည္းက်လာျခင္း၊ေပၚလာျခင္း။ ျမစ္ေရလွ်ံလ်က္။"},{"word":"spatial","state":"adj","def":"အကြာအေဝး။ အၾကား။ ကြက္လပ္။"},{"word":"spatter","state":"v","def":"ကေရ၊ရံႊ႔စသည္စဉ္သည္၊စဉ္ေစသည္။ ခေရ၊မိုးစသည္တျဖန္းျဖန္း၊တေျဖာက္ေျဖာက္က်သည္၊စဉ္သည္။ ကတေျဖာက္ေျဖာက္။ တျဖန္းျဖန္း။ ခၾကိဳးၾကားၾကိဳးၾကား။ ေျပာက္တေျပာက္က်ား။"},{"word":"spatula","state":"n","def":"ထိပ္ကားဇြန္းျပား။ ေယာက္မ။ ဆရာဝန္သံုးလွ်ာဖိကိရိယာ။"},{"word":"spatulate hand","state":"n","def":"ထိပ္ကားလက္"},{"word":"spawn","state":"v","def":"ဖား၊ငါးစသည္ဥဥသည္။ ေပါက္သည္။ ပြားသည္။ ေပါက္ပြားသည္။ ဖားဥ၊ငါးဥစသည္။ ဥ။"},{"word":"spawning fish","state":"n","def":"ငါးရစ္"},{"word":"spay","state":"v","def":"တိရစာၦန္အမကိုသင္းသည္။"},{"word":"speak","state":"v","def":"စကားေျပာသည္။ ကေျပာသည္။ ခစကားစျမည္ေျပာသည္။ စကားေျပာသည္။ ေျပာသည္။ ေခၚသည္။ ဂတယ္လီဖုန္းေျပာသည္။ ကလိုေျပာသည္၊တတ္သည္။ ခလိုေျပာသည္။ မိန္႔ၾကားသည္။ ေျပာသည္။ ေဟာသည္။ ေျပာသည္။ ဆိုသည္။ ေခၚသည္။ ေျပာသည္။ အေခၚအေျပာလုပ္သည္။ ေခၚသည္။ ေျပာသည္။ ေျပာပေလာက္ေအာင္မရိွ၊ဟုတ္စသည္။ အၾကမ္းဖ်င္း၊ျခံဳငံုစသည္ေျပာရရင္။ ဆိုပါစို႔။ ကေဟာသူ။ ေျပာသူ။ ခေျပာသူ။ ဘာသာစကားေျပာသူ။ လႊတ္ေတာ္ဥကၠဋႆဌ။ ထင္ရွားျပီးသားအထူးရွင္းျပစရာမလို။ ဘယ္သူကမွ်ေရွ႕ေနလိုက္ေပးစရာမလိုဘူး။ ကိုယ္စားေျပာသည္။ ကိုယ္စားျပဳသည္။ အဲဒါမင္းအျမင္ကိုး။ အေနနင့္ေျပာရလွ်င္။ ဘာသာစကားေျပာ။ စကားေျပာ။ တယ္လီဖုန္းျဖင့္စံေတာ္ခ်ိန္ေျဖေပးျခင္း။ ပြင့္ပြင့္လင္းလင္းေျပာသည္။ ေၾကာင္းျပလ်က္ရိွသည္။ ပြင့္ပြင့္လင္းလင္းေျပာသည္။ ရဲရဲတင္းတင္းေျပာသည္။ ႏွင့္ပတ္သက္၍ေျပာသည္၊ဆိုသည္။ က်ယ္က်ယ္ေျပာသည္။ ဘက္ကေျပာသည္၊ရပ္တည္သည္။ ထင္ထင္ရွားရွားသက္ေသခံလ်က္ရိွသည္။ သူတစ္ပါးအေၾကာင္းအေကာင္းေျပာသည္၊မေကာင္းေျပာသည္။"},{"word":"speak/talk of the devil","state":"idm","def":"(တစ္ေယာက္ေယာက္အေၾကာင္း ေျပာေနစဉ္ ထိုသူဝင္လာေသာ အခါ ေျပာေသာစကား)။ ေဟာ လာပါျပီ။ ေသခဲဦးမယ္။ အသက္ရွည္ဦးမယ္။"},{"word":"speakeasy","state":"n","def":"အရက္ပုန္းဆိုင္။ ေမွာင္ခိုအရက္ဆိုင္။"},{"word":"speaker","state":"n","def":"စပီကာဖုန္း"},{"word":"speakerphone","state":"n","def":"ကိုင္စရာမလိုဘဲၾကားႏိုင္၊ေျပာႏိုင္ေသာဖုန္းတစ္မ်ိဳး။ စပီကာဖုန္း။"},{"word":"speakers","state":"n[pl]","def":"စပီကာဖုန္းမ်ား"},{"word":"speaking","state":"v[ing]","def":"စကားေျပေန"},{"word":"speaks","state":"v[sg]","def":"စကားေျပ"},{"word":"spear","state":"n","def":"လံွ။ လံွတံ။ ျမက္ကဲ့သို႔ေျမမွေပါက္ေသာပင္စည္ႏွင့္အရြက္ခြ်န္း။ လံွ၊ခက္ရင္းစသည္ျဖင့္ထိုးသည္။"},{"word":"spearhead","state":"n","def":"ေခါင္းေဆာင္။ ေခါင္သူၾကီး။ ဦးေဆာင္ဦးရြက္ျပဳသူ။ ေရွ႕ေဆာင္။ တိုက္စစ္မႉး။ တပ္ဦး။ ဦးေဆာင္သည္။"},{"word":"spearmint","state":"n","def":"ပူဒီနာတစ္မ်ိဳး။"},{"word":"spec","state":"n","def":"သတ္မွတ္ခ်က္။ ကံစြပ္ကံညား။"},{"word":"special","state":"adj","def":"အထူး။ သီးသန္႔။ တစ္ဘာသာ။ အထူးတလည္။ အထူး။ အထူးအထူးရဲအရာရိွ၊အထူးရထား၊အထူးထုတ္သတင္းစာစသည္။ အထူးနႈန္း။ ေလွ်ာ႔ေဈး။ ျဗိတိန္တြင္ႏိုင္ငံလံုျခံဳေရးတာဝန္အထူးရဲတပ္ဖဲြ႔။ သတင္းတပ္ဖဲြ႔။ အေရးေပၚကိစၥရပ္မ်ား၌ရဲတပ္ဖဲြ႔ကိုကူညီႏိုင္ရန္ေလ့က်င့္ေပးထားသူ။ အရန္ရဲ။ အျမန္ေခ်ာပို႔။ ရုပ္ရွင္၊ျပဇာတ္စသည္တြင္အလင္း၊အသံ၊ရုပ္စသည္အထူးဖန္တီးမႈနည္းပညာ။ သာမန္အားျဖင့္ခြင့္မျပဳေသာအခ်ိန္၊ေနရာတစ္ခုခု၌အထူးလက္ထပ္ခြင့္မိန္႔။ အထူးတလည္။ တကူးတက။ သက္သက္။ အထူးသျဖင့္။ ထူးထူးျခားျခား။ အျခားတစ္ဖက္၏အဆိုကိုတိုက္ရိုက္ေခ်ပျခင္းေသာ္လည္းေကာင္း၊ဝန္ခံျခင္းေသာ္လည္းေကာင္းမျပဳဘဲမိမိအတြက္အက်ိဳးရိွမည့္အခ်က္မ်ားကိုသာအသားေပးေလွ်ာက္လဲျခင္း။"},{"word":"specialer","state":"adj[com]","def":"ပို၍ထူး"},{"word":"specialism","state":"n","def":"အထူးျပဳဘာသာရပ္။"},{"word":"specialist","state":"n","def":"ဘာသာရပ္တြင္အထူးကြ်မ္းက်င္သူ။ ပါရဂူ။"},{"word":"specialists","state":"n[pl]","def":"အထူးကြ်မ္းက်င္သူမ်ား"},{"word":"speciality","state":"adv","def":"အထူးလုပ္ငန္း။ အထူးထုတ္ကုန္။ အထူးျပဳမႈ။"},{"word":"specialize","state":"v","def":"အထူးျပဳ"},{"word":"specialize, -ise","state":"v","def":"ကဘာသာရပ္၊ေဆးပညာရပ္တစ္ခုခုတြင္အထူးျပဳသည္။ ခအထူးထုတ္လုပ္၊ေဆာင္ရြက္သည္။ အထူးျပဳသည္။ အထူးျပဳျခင္း။ အထူးတီထြင္ထားေသာ။ အထူး။ အထူးေလ့က်င့္လိုက္စားရေသာ။ အထူး။"},{"word":"specialized","state":"adj","def":"အထူးတီထြင္ထားေသာ"},{"word":"specially","state":"adv","def":"အထူးတလည္"},{"word":"species","state":"n","def":"မ်ိဳးစိတ္။ အမ်ိဳး။ အစား။"},{"word":"specific","state":"adj","def":"တိက်ေသာ။ သတ္သတ္မွတ္မွတ္ျဖစ္ေသာ။ အတိအက်။ အေသးစိတ္အခ်က္အလက္။ အတိအက်။ ေသေသခ်ာခ်ာ။ တိတိက်က်။ အထူးသျဖင့္။ တိက်မႈ။ ျဒပ္တစ္ခု၏ထုထည္ႏွင့္ေရထုထည္တို႔၏နိႈင္းယွဉ္ခ်က္။ သိပ္သည္းဆ။"},{"word":"specifically","state":"adv","def":"ေသေသခ်ာခ်ာ"},{"word":"specification","state":"n","def":"အေသးစိတ္ေဖာ္ျပခ်က္။ သတ္မွတ္ခ်က္။ သတ္မွတ္ခ်က္။ သတ္မွတ္ခ်က္။ သတ္မွတ္မႈ။"},{"word":"specifications","state":"n[pl]","def":"သတ္မွတ္ခ်က္မ်ား"},{"word":"specified","state":"v[pt]","def":"သတ္မွတ္ခဲ့"},{"word":"specified","state":"v[pp]","def":"သတ္မွတ္ခဲ့ျပီး"},{"word":"specifies","state":"v[sg]","def":"ျပဵဋႆဌာန္း"},{"word":"specify","state":"v","def":"သတ္မွတ္သည္။ ျပဋႆဌာန္းသည္။"},{"word":"specifying","state":"v[ing]","def":"သတ္မွတ္ေန"},{"word":"specimen","state":"n","def":"နမူနာ။ ဓာတ္ခဲြစစ္ေဆးရန္နမူနာ။ လူစား။ လူမ်ိဳး။"},{"word":"specimens","state":"n[pl]","def":"နမူနာမ်ား"},{"word":"specious","state":"adj","def":"ဟုတ္မွန္သေယာင္ေယာင္ရိွေသာ္လည္းစင္စစ္မွားေနေသာ။ အျပင္ပန္းအဟန္႔ေကာင္းေသာ္လည္းအတြင္းသေဘာမေရရာေသာ။"},{"word":"speck","state":"n","def":"အစက္။ အေျပာက္။ အမႈန္။"},{"word":"speckle","state":"n","def":"အစက္အေျပာက္။ ေျပာက္ေျပာက္က်ားက်ား။ ေျပာက္က်ား။ အေျပာက္။"},{"word":"spectacle","state":"n","def":"ကပဲြ။ သဘင္။ ပဲြလမ္းအခမ္းအနား။ ချမင္ကြင္း။ ရႈခင္း။ ရယ္၊သနား၊ဩခ်စသည္စရာ။ သူမ်ားလက္ညိႈးထိုးခံရေအာင္လုပ္သည္။"},{"word":"spectacles","state":"n","def":"မ်က္မွန္တပ္ထားေသာ။ မ်က္မွန္ႏွင့္။"},{"word":"spectacular","state":"adj","def":"ကခမ္းနားၾကီးက်ယ္ေသာ။ ခအံ့မခန္းဖြယ္ရာ။ လက္ဖ်ားခါေလာက္ေသာ။ ၾကီးက်ယ္ခမ္းနားသည့္ပဲြ။ အံ့ဘနန္း။"},{"word":"spectator","state":"n","def":"ပဲြၾကည့္ပရိသတ္။ ေဘာလံုးကဲ့သို႔လူၾကိဳက္မ်ားေသာအားကစား။"},{"word":"spectral","state":"adj","def":"တေစၦႏွင့္တူေသာ။ သက္တံေရာင္စဉ္၏။ အသံလိႈင္းစဉ္၏။"},{"word":"spectre","state":"n","def":"တေစၦ။ စိတ္တေစၦေျခာက္လွန္႔မႈ။"},{"word":"spectro- comb form","state":"n","def":"သက္တံေရာင္စဉ္သို႔အသံလိႈင္းစဉ္။"},{"word":"spectrometer","state":"n","def":"ေရာင္စဉ္တိုင္းကိရိယာ။"},{"word":"spectroscope","state":"n","def":"ေရာင္စဉ္ၾကည့္ကိရိယာျဖင့္ဆန္းစစ္ျခင္း။ ေရာင္စဉ္ပညာ။"},{"word":"spectrum","state":"n","def":"သက္တံေရာင္စဉ္။ အသံလိႈင္းစဉ္။ အရည္အခ်င္း၊အေတြးအျမင္စသည္ဆိုင္ရာနယ္၊နယ္ပယ္တစ္ေၾကာ၊နယ္တစ္ဝန္းတစ္လ်ား။"},{"word":"spectrums","state":"n[pl]","def":"ေရာင္စဉ္မ်ား"},{"word":"speculate","state":"v","def":"မွန္းဆသည္။ ထင္ေၾကးေပးသည္။ ဆင္ျခင္သံုးသပ္သည္။ ကုန္ေဈးအတက္အက်တြင္အျမတ္ထုတ္ႏိုင္ရန္ေငြေၾကးစြန္႔စားရင္းႏီွးျမႈပ္ႏံွသည္။ ေဈးကစားသည္။ ေဈးကစားသူ။"},{"word":"speculation","state":"n","def":"ကထင္ျမင္ခ်က္ေပးျခင္း။ ထင္ေၾကးေပးျခင္း။ ခထင္ေၾကး။ ထင္ျမင္ခ်က္။ မွန္းဆခ်က္။ ေဈးကစားျခင္း။"},{"word":"speculative","state":"adj","def":"စိတ္ကူး။ အမွန္း။ ယုတၱိစမ္းစြန္႔စားရင္းႏီွးျမႈပ္ႏံွေသာ။ ေဈးကစားေသာ။"},{"word":"speech","state":"n","def":"ကစကား။ နႈတ္ေျပာ။ အေျပာ။ ဆံြ႔ျခင္း၊ထစ္ျခင္းစေသာနႈတ္ဆံြ႔မႈမ်ားကိုေပ်ာက္ကင္းေအာင္ကုသႏိုင္သည္။ လြတ္လပ္စြာေျပာဆိုခြင့္။ ခေျပာပံုဆိုပံု။ ေျပာေပါက္ဆိုေပါက္။ နႈတ္။ အာ။ ကမိန္႔ခြန္း။ စကား။ ခဇာတ္စာ၊ဇာတ္စကား။ ေက်ာင္းႏွစ္ပတ္လည္ဆုႏွင္းသဘင္။ အာေစးမေသာ။ မွင္တက္မေသာ။ ဆို႔နင့္ေသာ။ စကားထစ္ျခင္း၊မပီျခင္းကုထံုး။ စကားေျပာကုထံုး။"},{"word":"speeches","state":"n[pl]","def":"စကားမ်ား"},{"word":"speechify","state":"v","def":"ဟိတ္ဟန္တစ္ခဲြသားႏွင့္မိန္႔ခြန္းေျခြသည္။"},{"word":"speed","state":"n","def":"လ်င္ျမန္ျခင္း။ အျမန္။ အလ်င္အဟုန္။ ေရြ႔လ်ားနႈန္း။ အျမန္နႈန္း။ အရိွန္။ ကဖလင္အျမန္နႈန္း။ ခကင္မရာရွတၱာအျမန္နႈန္း။ စိတ္ၾကြေဆး။ ဂီယာခ်က္။ ေျပးသည္။ အဟုန္ျမွင့္သည္။ သတ္မွတ္နႈန္းထက္ေက်ာ္ေမာင္းသည္။ အရိွန္ျပင္းျပင္းႏွင့္။ အရိွန္ျမွင့္သည္။ သတ္မွတ္နႈန္းကိုေက်ာ္လြန္ေမာင္းျခင္း။ ျမန္ျမန္။ အလ်င္အျမန္။ လမ္းအလိုက္သတ္မွတ္အျမန္နႈန္း။"},{"word":"speed boat","state":"n","def":"စက္တပ္ေလွငယ္"},{"word":"speedboat","state":"n","def":"ေျပးအားေကာင္းေသာေမာ္ေတာ္ဘုတ္။ စပိဘုတ္။"},{"word":"speedometer","state":"n","def":"ကားေျပးနႈန္းတိုင္းကိရိယာ။"},{"word":"speeds","state":"n[pl]","def":"လ်င္ျမန္ျခင္း"},{"word":"speedway","state":"n","def":"ေမာ္ေတာ္ဆိုင္ကယ္ေမာင္းျပိဳင္ပဲြ။ အျမန္ေမာင္းလမ္းမ။"},{"word":"speedwell","state":"n","def":"အျပာေရာင္ေတာက္ေတာက္ပန္းမ်ားပြင့္ေသာအေလ့က်အပင္ငယ္။"},{"word":"spell","state":"v","def":"စာလံုးေပါင္း"},{"word":"spell","state":"n","def":"စာလံုးေပါင္း"},{"word":"spelled","state":"v[pt]","def":"စာလံုးေပါင္းခဲ့"},{"word":"spelled","state":"v[pp]","def":"စာလံုးေပါင္းခဲ့ျပီး"},{"word":"spelling","state":"n","def":"စာလံုးေပါင္း"},{"word":"spelling","state":"v[ing]","def":"စာလံုးေပါင္းေန"},{"word":"spellings","state":"n[pl]","def":"စာလံုးေပါင္းမ်ား"},{"word":"spells","state":"v[sg]","def":"စာလံုးေပါင္း"},{"word":"spells","state":"n[pl]","def":"စာလံုးေပါင္းမ်ား"},{"word":"spelt","state":"v[pt]","def":"စာလံုးေပါင္းခဲ့"},{"word":"spelt","state":"v[pp]","def":"စာလံုးေပါင္းခဲ့ျပီး"},{"word":"spend","state":"v","def":"သံုး"},{"word":"spending","state":"v[ing]","def":"သံုးေန"},{"word":"spent","state":"v[pt]","def":"သံုးခဲ့"},{"word":"spent","state":"v[pp]","def":"သံုးခဲ့ျပီး"},{"word":"spent","state":"adj","def":"အားကုန္ေသာ။ အားျပတ္ေသာ။ မထိေရာက္ေသာ။"},{"word":"spents","state":"v[sg]","def":"သံုး"},{"word":"sperm","state":"n","def":"သုတ္ေရ"},{"word":"sperms","state":"n[pl]","def":"သုတ္ေရမ်ား"},{"word":"spice","state":"n","def":"ဟင္းခတ္အေမြးအၾကိဳင္"},{"word":"spices","state":"n[pl]","def":"ဟင္းခတ္အေမြးအၾကိဳင္မ်ား"},{"word":"spider","state":"n","def":"ပင့္ကူ"},{"word":"spiders","state":"n[pl]","def":"ပင့္ကူမ်ား"},{"word":"spies","state":"n[pl]","def":"သူလ်ိဳမ်ား"},{"word":"spike","state":"n","def":"ေျငာင့္။(ေရွး) တံသင္း။ ဆူးခြွ်န္။ွ"},{"word":"spin","state":"v","def":"လွည့္"},{"word":"spinach","state":"n","def":"ဟင္းႏုႏြယ္"},{"word":"spinal cord","state":"n","def":"ေက်ာရိုးနာဗ္ၾကိဳး"},{"word":"spine","state":"n","def":"ေက်ာရိုး"},{"word":"spines","state":"n[pl]","def":"ေက်ာရိုးမ်ား"},{"word":"spining","state":"v[ing]","def":"လွည့္ေန"},{"word":"spinster","state":"n","def":"အပ်ိဳၾကီး"},{"word":"spinsters","state":"n[pl]","def":"အပ်ိဳၾကီးမ်ား"},{"word":"spiny eel","state":"n","def":"ငါးေျမြထိုး"},{"word":"spirit","state":"n","def":"စိတ္"},{"word":"spirits","state":"n[pl]","def":"စိတ္မ်ား"},{"word":"spiritual","state":"adj","def":"ရစ္ပတ္ႏြယ္တတ္ေသာ"},{"word":"spit","state":"n","def":"တံေတြး"},{"word":"spite: in spite of","state":"n","def":"မလိုမုန္းထားစိတ္"},{"word":"spittle","state":"n","def":"တံေတြး"},{"word":"spleen","state":"n","def":"သရက္ရြက္"},{"word":"spleens","state":"n[pl]","def":"သရက္ရြက္မ်ား"},{"word":"split","state":"n","def":"ခဲြထြက္ျခင္း"},{"word":"split","state":"v","def":"အုပ္စုခဲြ"},{"word":"splits","state":"n[pl]","def":"ခဲြထြက္ျခင္းမ်ား"},{"word":"spoil","state":"v","def":"ဖ်က္"},{"word":"spoiled","state":"v[pt]","def":"ဖ်က္ခဲ့"},{"word":"spoiled","state":"v[pp]","def":"ဖ်က္ခဲ့ျပီး"},{"word":"spoiling","state":"v[ing]","def":"ဖ်က္ေန"},{"word":"spoils","state":"v[sg]","def":"ဖ်က္"},{"word":"spoilt","state":"v[pt]","def":"ဖ်က္ခဲ့"},{"word":"spoilt","state":"v[pp]","def":"ဖ်က္ခဲ့ျပီး"},{"word":"spoke","state":"v[pt]","def":"စကားေျပာခဲ့"},{"word":"spoken","state":"pp","def":"ညင္သာစြာစသည္ေျပာတတ္ေသာ။ ေကာင္းစြာေျပာအပ္ေသာ။ ယူျပီးသား။ ဦးျပီးသား။ လူရိွတယ္။ နႈတ္ေျပာ။ အေျပာ။"},{"word":"spoken","state":"v[pp]","def":"စကားေျပာခဲ့ျပီး"},{"word":"spoken","state":"adj","def":"(ေကာင္းစြာ)ေျပာအပ္"},{"word":"spokesman","state":"n","def":"ေျပာေရးဆိုခြင့္ရိွသူ။"},{"word":"sponge","state":"n","def":"ေရျမႈပ္ပင္လယ္သတၱဝါ။ ကေဆးေၾကာတိုက္ခြ်တ္ရာတြင္သံုးေသာေရျမႈပ္။ ခရာဘာေရျမႈပ္။ ကေရျမႈပ္စသည္ျဖင့္ေရဖတ္တိုက္သည္။ ခေရျမႈပ္စသည္ျဖင့္တို႔၍၊တိုက္၍ဖယ္ရွားသည္။ ကပ္ရပ္ေနသည္။ ကပ္ေျမွာင္သည္။ သြားပြတ္တံ၊သြားတိုက္ေဆးစသည္ထည့္ရန္ခရီးေဆာင္အိတ္ငယ္။ ကိတ္မုန္႔ပြ၊ကိတ္ပြ။ မုန္႔ခ်ိဳေပါင္း။ မုန္႔ခ်ိဳပြ။ ကပ္ရပ္စားသူ။ ကပ္ပါးရပ္ပါး။ ပြရြေပ်ာ႔အေသာ။ လက္ေျမွာက္အရံႈးေပးသည္။"},{"word":"sponges","state":"n[pl]","def":"ကိုယ္တိုက္ေသာ ေရျမႈပ္မ်ား"},{"word":"sponsor","state":"n","def":"ျပပဲြ၊ျပိဳင္ပဲြ၊ရုပ္ျမင္သံၾကား၊ေရဒီယိုအစီအစဉ္က်င္းပစရိတ္ကိုေၾကာ္ျငာခြင့္အတြက္ကမကထျပဳသူ၊ကုမၸဏီ။ ျပပဲြ၊ျပိဳင္ပဲြစသည္တြင္ပါဝင္သူအတြက္ကုန္က်စရိတ္က်ခံလႉဒါန္းသူ။ ေလ့က်င့္မႈကုန္က်စရိတ္ေထာက္ပံ့ေပးသူ၊ကုမၸဏီ။ ဥပေဒသစ္စသည္အဆိုတင္သြင္းသူ။ တစ္စံုတစ္ဦးအတြက္အာမခံသူ။ ပုဂၢိဳလ္တစ္ဦးဦး၊ကိစၥ၊ပဲြလမ္းတစ္ခုခုအတြက္ကမကထျပဳသည္သို႔ေထာက္ပံ့လႉဒါန္းသည္သို႔အာမခံေပးသည္။ ကေငြေၾကးအေထာက္အပံ့။ ခကမကထျပဳမႈ။"},{"word":"sponsor","state":"v","def":"ကမကထျပဳ"},{"word":"sponsored","state":"v[pt]","def":"ကမကထျပဳ ခဲ့"},{"word":"sponsored","state":"v[pp]","def":"ကမကထျပဳ ခဲ့ျပီး"},{"word":"sponsoring","state":"v[ing]","def":"ကမကထျပဳ ေန"},{"word":"sponsors","state":"n[pl]","def":"ကမကထျပဳသူမ်ား"},{"word":"sponsors","state":"v[sg]","def":"ကမကထျပဳ"},{"word":"spontaneity","state":"n","def":"အေလ်ာက္ဘာသာျဖစ္ျခင္း။ သဘာဝက်ျခင္း။ အလိုအေလ်ာက္သေဘာသက္ဝင္ျခင္း"},{"word":"spontaneous","state":"adj","def":"ကအလိုအေလ်ာက္ျဖစ္ေသာ။ ပင္ကိုေစ့ေဆာ္မႈထင္ဟပ္ေသာ။ ခပင္ကိုသေဘာေဆာင္ေသာ။ သဘာဝက်ေသာ။ အလိုအေလ်ာက္ေတာက္ေလာင္ျခင္း။ ေကာက္ကာငင္ကာ။"},{"word":"spoof","state":"n","def":"တစ္စံုတစ္ရာကိုဟာသျဖစ္ေအာင္ပံုၾကီးခ်ဲ႕ျပျခင္း။ အေျပာင္အျပက္သေဘာျဖင့္လွည့္ျဖားျခင္း။ တစ္ဦးတစ္ေယာက္၏အမူအရာ၊တစ္စံုတစ္ခု၏ပံုပန္းကိုဖမ္း၍ရယ္ဖြယ္ျဖစ္ေအာင္ခ်ဲ႕ထြင္သရုပ္ေဖာ္သည္။ ျပက္ရယ္ျပဳသည္။ ဟာသလုပ္သည္။ ေလွာင္သည္။"},{"word":"spook","state":"n","def":"တေစၦ။ သရဲ။ ကေျခာက္လွန္႔သည္။ ခလန္႔သည္။ တေစၦေျခာက္ေသာ။ ေက်ာခ်မ္းစရာေကာင္းေသာ။"},{"word":"spool","state":"n","def":"ကရစ္သည္သို႔ရစ္မွၾကိဳးစသည္ကိုေလွ်ာ႔ေပးသည္။"},{"word":"spoon","state":"n","def":"ကဇြန္း။ ခတစ္ဇြန္းစာ။ ဇြန္းျဖင့္ခပ္သည္။ တစ္ဇြန္းစာ။"},{"word":"spoonerism","state":"n","def":"လွ်ာခလုတ္တိုက္၍အစစကားသံတို႔ကိုကိုးရိုးကားရားေရွ႕ေနာက္လဲြမွားဆိုမိျခင္း။ ကိုးရိုးကားရားလွ်ာခလုတ္တိုက္ျခင္း။ သာဓကဟုေျပာရမည့္အစားဟုထြက္သြားျခင္း။"},{"word":"spoonfeed","state":"v","def":"ကဇြန္းျဖင့္ခံြ႔သည္။ ခတပည့္၏ကိုယ္ပိုင္ေတြးေခၚမႈႏံု႔နဲ့ေစေသာအားျဖင့္ႏို႔သက္ခံေစ၍သင္ၾကားေပးသည္။ ခူးျပီးခပ္ျပီးခံြ႔သည္။"},{"word":"spoons","state":"n[pl]","def":"ဇြန္းမ်ား"},{"word":"spoor","state":"n","def":"ေတာရိုင္းတိရစာၦန္ကိုေျခရာခံ၊အနံ့ခံလိုက္ႏိုင္ရန္တင္က်န္ေသာေျခရာ၊အနံ့အသက္။"},{"word":"sporadic","state":"adj","def":"ျပတ္ေတာင္းျပတ္ေတာင္းရြာေသာ၊ေပၚေသာ၊ျဖစ္ေသာ။ ျပတ္ေတာင္းျပတ္ေတာင္း။ ထံု႔ပိုင္းထံု႔ပိုင္း။"},{"word":"spore","state":"n","def":"မိႈစေသာအပင္မ်ားမ်ိဳးပြားမႈဖန္တီးသည့္မ်ိဳးမႈန္။"},{"word":"sporran","state":"n","def":"စေကာ႔လူမ်ိဳးတို႔၏တိုင္းရင္းဝတ္စံုတြင္ခါးပတ္ေခါင္းေအာက္တဲြလ်ားခ်ထားေသာသားေရအိတ္။"},{"word":"sport","state":"n","def":"ကအားကစား။ ခအားကစားအမ်ိဳးအစား။ အေျပာင္အျပက္။ အားကစားပဲြ။ ကမိတ္ေဆြေကာင္း။ ခအားကစားစိတ္ဓာတ္ရိွသူ၊မရိွသူ။ ခင္မင္မႈကိုေဖာ္ျပေသာအာလုပ္စကား။ မိတ္ေဆြ။ မူကဲြျဖစ္ေသာအပင္၊တိရစာၦန္။ ဆင္ျမန္းသည္။ ေမြးထားသည္။ ေဆာ႔ကစားသည္။ သြယ္လ်ျပီးအျမန္ေမာင္းႏိုင္ေသာအေပ်ာ္စီးကားငယ္။ အမ်ားအားျဖင့္အမိုးကိုတင္ႏိုင္ခ်ႏိုင္သည္။ ေက်ာင္းအားကစားပြေန့။ ဝတ္စံု၏အစိတ္အပိုင္းမဟုတ္ေသာေယာက်္ားဝတ္ကုတ္အက်ၤီ။"},{"word":"sport shirt","state":"n","def":"စပို႔ရွပ္"},{"word":"sporting","state":"adj","def":"အားကစားႏွင့္ပတ္သက္ေသာ၊လိုက္စားေသာစသည္။ သေဘာသကာယျပည့္ဝေသာ။ ျဖစ္ႏိုင္ေျခရိွေသာအခြင့္အလမ္း။ အားကစားသမားစိတ္ဓာတ္အျပည့္ျဖင့္။"},{"word":"sports","state":"n[pl]","def":"အားကစားမ်ား"},{"word":"sportscast","state":"n","def":"အားကစားျပိဳင္ပဲြရုပ္ျမင္သံၾကား၊ေရဒီယိုမွလႊင့္ထုတ္ျခင္း။ အားကစားျပိဳင္ပဲြအစီအစဉ္ေၾကညာသူ။"},{"word":"sportsman","state":"n","def":"အားကစားသမားစိတ္ဓာတ္ရိွသူ။ မွ်တျခင္း၊သေဘာျပည့္ဝျခင္းစေသာအားကစားသမားပီသေသာလကၡဏာအျပဳအမူစသည္။ အားကစားသမားပီသမႈ။"},{"word":"sportswear","state":"n","def":"အားကစားဝတ္စံု။ အားကစားအက်ၤီ၊ေဘာင္းဘီ၊ဦးထုပ္စသည္"},{"word":"sporty","state":"adj","def":"အားကစားေတာ္ေသာ၊အားကစားလိုက္စားေသာ။ အေရာင္အေသြးထူးျခား၍မ်က္စိက်စရာေကာင္းေသာအဝတ္အထည္။ ေၾကာ႔ေမာ႔၍အျမန္ေမာင္းႏိုင္ေသာကား။"},{"word":"spot","state":"n","def":"ကအေျပာက္။ ခစြန္းထင္းေနေသာအကြက္။ အစြန္း။ အသားအေရေပၚတြင္အနာေရာဂါေၾကာင့္ေပၚေသာအနီဖု။ ဝက္ျခံ။ ကေနရာ။ အကြက္အကြင္း။ ခေဖ်ာ္ေျဖခင္း။ အပိုင္း။ အကန္႔။ က႑။ အခန္းက႑။ အခန္း။ အစက္။ နည္းနည္းေလာက္။ ေရဒီယို၊ရုပ္ျမင္သံၾကား၊ဇာတ္သဘင္တြင္အခန္း။ အဆင့္။ ရွာေတြ႔သည္။ ရိပ္စားမိသည္။ ႏွင့္တဲြသံုးသည္မိုးဖဲြဖဲြက်သည္။ အစက္အေျပာက္စြန္းသည္၊ပါရိွသည္။ မလူးသာမလြန္႔သာအေျခအေန။ အက်ပ္အတည္း။ ခ်က္ခ်င္း။ ပဲြခ်င္းျပီး။ လက္ငင္း။ ျဖစ္ပြားရာေနရာ။ က်ဉ္းထဲက်ပ္ထဲ။ အလစ္ဝင္စစ္ေဆးျခင္း။ သပ္ရပ္သန္႔ရွင္းေသာ။ ျပစ္ျခည္မစြန္းေသာ။ ကြက္တိျဖစ္ေသာ။ အေျပာက္အေျပာက္။ အစက္အေျပာက္အဆင္။ လုပ္ငန္းတစ္ခုအတြက္အလားအလာ၊အရည္အေသြးရိွသူတို႔ကိုရွာေဖြေပးသူသို႔အေပ်ာ္တမ္းရွာေဖြမွတ္သားသူ။ အကဲၾကည့္ေလယာဉ္။ ကင္းေထာက္ေလယာဉ္။ အဖုအပိမ္႔တင္းက်မ္း။ ေျပာက္တေျပာက္က်ား။ မေကာင္းတစ္ခ်က္ေကာင္းတစ္ခ်က္ျဖစ္ေသာ။"},{"word":"spotlight","state":"n","def":"မီးေမာင္း။ ပရိသတ္အာရံု။ မီးေမာင္းထိုးသည္။ မီးေမာင္းထိုးျပသည္။"},{"word":"spots","state":"n[pl]","def":"အစက္မ်ား"},{"word":"spouse","state":"n","def":"ခင္ပြန္းသို႔ဇနီး။ ခင္ပြန္းသည္။"},{"word":"spouses","state":"n[pl]","def":"ခင္ပြန္းမ်ား"},{"word":"spout","state":"n","def":"ကရားနႈတ္သီး။ ျပြန္၊ပိုက္ေခါင္း။ ေရပန္း။ ေငါက္ခနဲပန္းထြက္ေနေသာအရည္။ ကေငါက္ခနဲပန္းထြက္သည္။ ပန္းထြက္သည္။ ခပန္းထြက္သည္။ ဂေဝလငါးေရပန္းမႈတ္ထုတ္သည္။ စကားတံရွည္သည္။ စကားေၾကာရွည္သည္။ ေလရွည္သည္။ ေလပန္းသည္။ သြားပါျပီ။ တလဲြစီျဖစ္သည္။ သဲထေရသြန္ျဖစ္သည္။"},{"word":"sprain","state":"v","def":"အဆစ္လဲြသည္။ အဆစ္လဲြျခင္း။"},{"word":"sprat","state":"n","def":"ငါးျပား၊ငါးထန္းရြက္တို႔ႏွင့္ဆင္ေသာ၊စားရေသာဥေရာပပင္လယ္ငါးတစ္မ်ိဳး။"},{"word":"sprawl","state":"v","def":"ေျခကားရားလက္ကားရားလဲသည္။ ေျခပစ္လက္ပစ္လေလ်ာင္း၊ထိုင္ေနသည္။ ျပန္႔က်ေနသည္။ ျဖစ္သလိုျပန္႔က်ေနျခင္း။ ကိုးရိုးကားရားေနထိုင္သြားလာျခင္း။ ေျခပစ္လက္ပစ္လေလ်ာင္းထိုင္ေနေသာ။ ေျခကားရားလက္ကားရားပံုလေနေသာ။"},{"word":"spray","state":"n","def":"ကအခက္။ ခပန္းခက္ပံုအဆင္တန္ဆာ။ ပန္းခက္။ ပန္းစည္း။ ေရမႈန္ေရမႊား။ ဥဖြာဆန္ၾကဲပစ္ထုတ္၊ပန္းထြက္လာေသာအရာ။ ကမႈတ္ေဆးဘူး၊ျခင္ေဆးဘူး၊ေလသန္႔ဘူးစသည္မွပန္းထုတ္ေပးေသာအရည္မႈန္။ ခမႈတ္ေဆးဘူး၊ျခင္ေဆးဘူးစသည္ကဲ့သို႔အရည္မႈန္ဖ်န္းမႈတ္ေပးေသာဘူး။ ကမႈတ္သည္။ ဖ်န္းသည္။ ခဖြာခနဲလြင့္စဉ္ေစသည္။ ဖြာဆန္ၾကေအာင္ေမႊပစ္သည္။ အမႈန္အမႊားအျဖစ္ပန္းထုတ္သည္၊ပန္းထြက္သည္္္္။ ကေဆးစသည္မႈတ္သမား။ ခေဆးစသည္မႈတ္ရန္၊ဖ်န္းရန္ကိရိယာ။ အရည္ဖ်န္းရန္၊မႈတ္ရန္ကိရိယာ။ ဘူးမွပန္းထုတ္၊မႈတ္ဖ်န္းႏိုင္ေသာအရာ။"},{"word":"spray","state":"v","def":"ဖ်န္း"},{"word":"sprayed","state":"v[pt]","def":"ဖ်န္းခဲ့"},{"word":"sprayed","state":"v[pp]","def":"ဖ်န္းခဲ့ျပီး"},{"word":"spraying","state":"v[ing]","def":"ဖ်န္း"},{"word":"sprays","state":"n[pl]","def":"ပန္းခက္ပံု အဆင္တန္ဆာမ်ား"},{"word":"sprays","state":"v[sg]","def":"ဖ်န္း"},{"word":"spread","state":"v","def":"ကသုတ္သည္။ ခင္းသည္။ ခသုတ္သည္။ ဖံုးသည္။ ဂသုတ္ႏိုင္သည္။ ျဖန္႔သည္။ ျဖန္႔ခင္းသည္။ ခင္းသည္။ ပ်ံ႔သည္။ ပ်ံ႔ႏံွ႕သည္။ ကူးစက္သည္။ ျဖန္႔သည္။ ျဖန္႔သည္။ ျဖန္႔ၾကက္သည္။ က်ယ္ေျပာသည္။ ျပန္႔သည္။ ေပက်ံသည္။ ဆန္႔သည္။ ဆဲြသည္။ ကျဖန္႔ကားႏိုင္ေသာအတိုင္းအတာ။ အက်ယ္။ ျဗက္။ ခအျပန္႔အျပင္အျဖစ္တည္ရိွေသာအရာ။ ျပင္က်ယ္သို႔အခ်ိန္အတိုင္းအတာ။ ဂကဲြျပားမႈ။ ပ်ံ႔ႏံွ႕မႈ။ ကူးစက္ပ်ံ႔ႏံွ႕မႈ။ တိုးခ်ဲ႕ျပန္႔ကားျခင္း။ မ်က္ႏွာျပည့္သတင္း၊ေဆာင္းပါးစသည္။ တည္ခင္းထားေသာစားဖြယ္။ ဒိန္ခဲအေပ်ာ႔ကဲ့သို႔ေပါင္မုန္႔တြင္သုတ္စားစရာ။ က်ယ္ေျပာေသာလယ္၊ျခံ။ ေျခေညာင္းလက္ဆန္႔၊ေျခဆင္းလဲလူေနသည္။ ေျခကားရားလက္ကားရားျဖစ္သြားသည္သို႔ေျခပစ္လက္ပစ္ေနသည္။ သုတ္လိမ္းရန္သံုးရေသာအရာ။ သုတ္တံ။ သတင္း၊အတင္းစသည္ျဖန္႔သူ။ ဗန္းေရႊေမာင္း။ ေတာမီးပမာတစ္မုဟုတ္ခ်င္းပ်ံ႔ႏံွ႕သြားသည္။ ဩဇာအာဏာျဖန္႔ၾကက္သည္။ လူခ်င္းခ်ဲလိုက္သည္။ ဘဝတြင္စတင္ေျခခ်သည္။ ဥအပ်ံသင္သည္။"},{"word":"spread","state":"v[pt]","def":"သုတ္ခဲ့"},{"word":"spread","state":"v[pp]","def":"သုတ္ခဲ့ျပီး"},{"word":"spreading","state":"v[ing]","def":"သုတ္ေန"},{"word":"spreads","state":"v[sg]","def":"သုတ္"},{"word":"spreadsheet","state":"n","def":"စာရင္းကိန္းဂဏန္းအခ်က္အလက္တို႔ကိုဇယား၊စာတိုင္တို႔တြင္အလြယ္တကူျဖည့္သြင္း၊တြက္ခ်က္၊ျပင္ဆင္ေရႊ႔ေျပာင္းေပးႏိုင္ေသာကြန္ပ်ဴတာလုပ္ငန္းအစီအစဉ္။ ယင္းသို႔ျပဳစုျပီးသည္ကိုထုတ္ယူရသည့္ကြန္ပ်ဴတာပံုႏိွပ္မူ။"},{"word":"spree","state":"n","def":"စိတ္လြတ္လက္လြတ္ျပဳမူျခင္း။"},{"word":"sprig","state":"n","def":"အခက္။ အခက္အရြက္တို႔ျဖင့္ပံုေဖာ္ထားေသာအဆင္။ အခက္ပန္းအထည္။"},{"word":"sprightly","state":"adj","def":"သန္ျမန္ေသာ။ သန္တုန္းျမန္တုန္းရိွေသာ။"},{"word":"spring","state":"n","def":"သံပတ္သို႔ေလးသို႔စပရင္။ ဘူးႏြယ္။ စမ္း။ ျပန္ကန္ႏိုင္ေသာသတၱိ။ ရုန္းကန္အား။ ျမဴးၾကြသြက္လက္ေပါ႔ပါးျခင္း။ လႊားခနဲခုန္ျခင္း။ ခုန္တက္ျခင္း၊ခုန္အုပ္ျခင္း။ ေႏြဦး။ လႊားခနဲခုန္ထြက္သည္၊ခုန္တက္သည္၊ခုန္အုပ္သည္။ ရုတ္တရက္ပြင့္သည္၊ပိတ္သည္၊ရိုက္သည္၊ခတ္သည္။ ခလုတ္ျဖဳတ္သည္။ ခလုတ္ဖြင့္သည္။ အံဖံုးစသည္ေမာင္းျဖင့္ပိတ္သည္။ စက္ႏိုးသည္။ မထုတ္သည္။ ၾကက္ပ်ိဳကေလး။ ျငင္းပယ္ဝါက်မ်ားတြင္ငယ္ရြယ္သူ။ ငယ္ေတာ႔တာ။ အိမ္၊အခန္းစသည္ကိုက်က်နနေျပာင္စင္ေအာင္ရွင္းလင္းသည္။ ေျပာင္စင္ေအာင္ရွင္းလင္းျခင္း။ ဇာတိျဖစ္သည္။ ေပါက္ဖြားသည္။ ေပၚလာသည္။ ေဂၚဖီပင္ႏု။ ေရယိုသည္။ ေရဝင္သည္။ ေပါက္သည္။ ေမာင္းလက္ဆင္ထားေသာ။ ဆိုင္းမဆင့္ဗံုမဆင့္ေျပာသည္။ ၾကက္သြန္ျမိတ္။ ေကာ္ျပန္႔လိပ္။ ေရထရက္။ မိႈလိုေပါက္သည္။ ရြအေသာ။ ေပါ႔ပါးရႊင္ပ်ေသာ။"},{"word":"spring rolls","state":"n","def":"ေကာ္ျပန္႔ေၾကာ္"},{"word":"springboard","state":"n","def":"ေလထဲသို႔ကိုယ္ကိုေျမာက္တက္သြားေအာင္ခုန္ႏိုင္ရန္ျပန္ကန္အားရိွသည့္ပ်ဉ္ခ်ပ္။ ဒိုင္ဗင္ထိုးရန္ေရကူးကန္၏ေရျပင္အထက္တြင္လည္းေကာင္း၊ကြ်မ္းဘားထိုးရန္ၾကမ္းျပင္အထက္၌လည္းေကာင္းဆင္ထားေလ့ရိွသည္။ လုပ္ငန္းတစ္ရပ္သို႔စတင္တက္လွမ္းရာ။"},{"word":"springbok","state":"n","def":"ေလထဲသို႔ရုတ္တရက္ေပါ႔ပါးစြာေျမာက္တက္ေအာင္ခုန္တတ္ေသာေတာင္အာဖရိကေဂဇဲဆိတ္သမင္ငယ္။"},{"word":"springer","state":"n","def":"အမဲလိုက္ေခြးငယ္တစ္မ်ိဳး။"},{"word":"springs","state":"n[pl]","def":"စမ္းမ်ား"},{"word":"springtime","state":"n","def":"ေႏြဦးသမယ။"},{"word":"sprinkle","state":"v","def":"ဖ်န္းသည္သို႔ျဖဴးသည္။ ဟိုတစ္စဒီတစ္စအနည္းငယ္မွ်။ နည္းနည္း။ ျပက္သိကာ။ ျမက္ခင္းစသည္ေရဖ်န္းေပးသည့္ပိုက္ေခါင္း။ အေဆာက္အအံုအတြင္းမီးေလာင္မႈျဖစ္ပြားကသတ္မွတ္အပူခ်ိန္ေက်ာ္သည့္အခါအလိုအေလ်ာက္ေရဖ်န္းသတ္သည့္ပိုက္ေခါင္း။ ေျပာက္တေျပာက္က်ားမွ်သာရိွေသာအရာ၊ဦးေရ။ မိုးတစ္ျပိဳက္ႏွစ္ျပိဳက္။"},{"word":"sprint","state":"v","def":"တာတိုေျပးသည္။ အျမန္ေျပးသည္။ တာတိုေျပးပဲြ၊ေရကူးျပိဳင္ပဲြစသည္။ တစ္ဟုန္ထိုးေျခကုန္သုတ္ျခင္း။ တာတိုအေျပးသမား။"},{"word":"sprint","state":"n","def":"တာတိုေျပးပဲြ"},{"word":"sprints","state":"n[pl]","def":"တာတိုေျပးပဲြမ်ား"},{"word":"sprite","state":"n","def":"နတ္ကေလး။ မွင္စာကေလး။"},{"word":"spritzer","state":"n","def":"ဝိုင္ႏွင့္ဆိုဒါစပ္ထားေသာယမကာ။"},{"word":"sprocket","state":"n","def":"ေခြးသြားစိပ္ဘီးရိွေခြးသြားစိပ္။"},{"word":"sprout","state":"v","def":"ကအစို႔အေညွာက္ထြက္သည္။ ခအေမြးအမွင္ေပါက္သည္။ ေပၚေပါက္သည္။ ေပါက္သည္။ အစို႔။ အေညွာက္။"},{"word":"spruce","state":"adj","def":"သပ္ရပ္သန္႔စင္ေသာ။ ၁သန္႔ျပန္႔သပ္ရပ္ေအာင္ျပင္သည္။ ျဖီးလိမ္းသည္။ ကထင္းရႉးတစ္မ်ိဳး။ ခယင္း၏အသား။"},{"word":"sprung","state":"adj","def":"စပရင္ပါေသာ။"},{"word":"spry","state":"adj","def":"အသက္အရြယ္ၾကီးေသာ္လည္းေပါ႔ပါးသြက္လက္ေသာ။"},{"word":"spud","state":"n","def":"အာလူး။"},{"word":"spume","state":"n","def":"လိႈင္းေခါင္းျဖဴမွေရျမႈပ္။"},{"word":"spun","state":"v[pt]","def":"လွည့္ခဲ့"},{"word":"spun","state":"v[pp]","def":"လွည့္ခဲ့ျပီး"},{"word":"spur","state":"n","def":"ျမင္းစီးသူမ်ား၏ ဖေႏွာင့္တြင္တပ္ဆင္သည့္ ျမင္းအသြားျမန္ေစရန္ ၀မ္းကိုခတ္သည့္ ဆူးငယ္ဘီး။ တိုက္တြန္းခ်က္။ လံႈ႔ေဆာ္ခ်က္။ နိႈးေဆာ္အားေပးျခင္း။"},{"word":"spy","state":"n","def":"သူလ်ိဳ"},
]}